zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211cxx_ca35.h
/*!< AHB6 peripherals */
/*!< USB registers base address */
#define USB_OTG_GLOBAL_BASE                 ((uint32_t )0x000UL)
#define USB_OTG_DEVICE_BASE                 ((uint32_t )0x800UL)
#define USB_OTG_IN_ENDPOINT_BASE            ((uint32_t )0x900UL)
#define USB_OTG_OUT_ENDPOINT_BASE           ((uint32_t )0xB00UL)
#define USB_OTG_EP_REG_SIZE                 ((uint32_t )0x20UL)
#define USB_OTG_HOST_BASE                   ((uint32_t )0x400UL)
#define USB_OTG_HOST_PORT_BASE              ((uint32_t )0x440UL)
#define USB_OTG_HOST_CHANNEL_BASE           ((uint32_t )0x500UL)
#define USB_OTG_HOST_CHANNEL_SIZE           ((uint32_t )0x20UL)
#define USB_OTG_PCGCCTL_BASE                ((uint32_t )0xE00UL)
#define USB_OTG_PCGCCTL1_BASE               ((uint32_t )0xE04UL)
#define USB_OTG_FIFO_BASE                   ((uint32_t )0x1000UL)
#define USB_OTG_FIFO_SIZE                   ((uint32_t )0x1000UL)
/*!< FMC Banks registers base address */
#define FMC_Bank1_R_BASE                    (FMC_BASE + 0x0000UL)
#define FMC_Bank1E_R_BASE                   (FMC_BASE + 0x0104UL)
#define FMC_Bank3_R_BASE                    (FMC_BASE + 0x0080UL)
#define FMC_Common_R_BASE                   (FMC_BASE + 0x0020UL)

/*!< Device electronic signature memory map */
#define UID_BASE                            (0x44000014UL)            /*!< Unique Device ID register base address */
#define PACKAGE_BASE                        (0x440001E8UL)            /*!< Package Data register base address */
#define RPN_BASE                            (0x44000024UL)            /*!< Device Part Number register base address */
#define DV_BASE                             (0x4A010000UL)            /*!< Device Version register base address */

/**
  * @}
  */
#define TIM2                                ((TIM_TypeDef *) TIM2_BASE)
#define TIM3                                ((TIM_TypeDef *) TIM3_BASE)
#define TIM4                                ((TIM_TypeDef *) TIM4_BASE)
#define TIM5                                ((TIM_TypeDef *) TIM5_BASE)
#define TIM6                                ((TIM_TypeDef *) TIM6_BASE)
#define TIM7                                ((TIM_TypeDef *) TIM7_BASE)
#define TIM12                               ((TIM_TypeDef *) TIM12_BASE)
#define TIM13                               ((TIM_TypeDef *) TIM13_BASE)
#define TIM14                               ((TIM_TypeDef *) TIM14_BASE)
#define LPTIM1                              ((LPTIM_TypeDef *) LPTIM1_BASE)
#define LPTIM2                              ((LPTIM_TypeDef *) LPTIM2_BASE)
#define SPI2                                ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                                ((SPI_TypeDef *) SPI3_BASE)
#define SPDIFRX                             ((SPDIFRX_TypeDef *) SPDIFRX_BASE)
#define USART2                              ((USART_TypeDef *) USART2_BASE)
#define USART3                              ((USART_TypeDef *) USART3_BASE)
#define UART4                               ((USART_TypeDef *) UART4_BASE)
#define UART5                               ((USART_TypeDef *) UART5_BASE)
#define I2C1                                ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                                ((I2C_TypeDef *) I2C2_BASE)
#define I2C3                                ((I2C_TypeDef *) I2C3_BASE)
#define I3C1                                ((I3C_TypeDef *) I3C1_BASE)
#define I3C2                                ((I3C_TypeDef *) I3C2_BASE)
#define I3C3                                ((I3C_TypeDef *) I3C3_BASE)
#define TIM10                               ((TIM_TypeDef *) TIM10_BASE)
#define TIM11                               ((TIM_TypeDef *) TIM11_BASE)

#define TIM1                                ((TIM_TypeDef *) TIM1_BASE)
#define TIM8                                ((TIM_TypeDef *) TIM8_BASE)
#define USART6                              ((USART_TypeDef *) USART6_BASE)
#define SPI1                                ((SPI_TypeDef *) SPI1_BASE)
#define SPI4                                ((SPI_TypeDef *) SPI4_BASE)
#define TIM15                               ((TIM_TypeDef *) TIM15_BASE)
#define TIM16                               ((TIM_TypeDef *) TIM16_BASE)
#define TIM17                               ((TIM_TypeDef *) TIM17_BASE)
#define SPI5                                ((SPI_TypeDef *) SPI5_BASE)
#define SAI1                                ((SAI_TypeDef *) SAI1_BASE)
#define SAI1_Block_A                        ((SAI_Block_TypeDef *) SAI1_Block_A_BASE)
#define SAI1_Block_B                        ((SAI_Block_TypeDef *) SAI1_Block_B_BASE)
#define SAI2                                ((SAI_TypeDef *) SAI2_BASE)
#define SAI2_Block_A                        ((SAI_Block_TypeDef *) SAI2_Block_A_BASE)
#define SAI2_Block_B                        ((SAI_Block_TypeDef *) SAI2_Block_B_BASE)
#define SAI3                                ((SAI_TypeDef *) SAI3_BASE)
#define SAI3_Block_A                        ((SAI_Block_TypeDef *) SAI3_Block_A_BASE)
#define SAI3_Block_B                        ((SAI_Block_TypeDef *) SAI3_Block_B_BASE)
#define USART1                              ((USART_TypeDef *) USART1_BASE)
#define SAI4                                ((SAI_TypeDef *) SAI4_BASE)
#define SAI4_Block_A                        ((SAI_Block_TypeDef *) SAI4_Block_A_BASE)
#define SAI4_Block_B                        ((SAI_Block_TypeDef *) SAI4_Block_B_BASE)
#define UART7                               ((USART_TypeDef *) UART7_BASE)

#define HPDMA1                              ((DMA_TypeDef *) HPDMA1_BASE)
#define HPDMA2                              ((DMA_TypeDef *) HPDMA2_BASE)
#define HPDMA3                              ((DMA_TypeDef *) HPDMA3_BASE)
#define OCTOSPI1                            ((OCTOSPI_TypeDef *) OCTOSPI1_BASE)
#define OTFDEC1                             ((OTFDEC_TypeDef *) OTFDEC1_BASE)
#define OTFDEC1_REGION1                     ((OTFDEC_Region_TypeDef *) OTFDEC1_REGION1_BASE)
#define OTFDEC1_REGION2                     ((OTFDEC_Region_TypeDef *) OTFDEC1_REGION2_BASE)
#define OTFDEC1_REGION3                     ((OTFDEC_Region_TypeDef *) OTFDEC1_REGION3_BASE)
#define OTFDEC1_REGION4                     ((OTFDEC_Region_TypeDef *) OTFDEC1_REGION4_BASE)
#define OTFDEC2                             ((OTFDEC_TypeDef *) OTFDEC2_BASE)
#define OTFDEC2_REGION1                     ((OTFDEC_Region_TypeDef *) OTFDEC2_REGION1_BASE)
#define OTFDEC2_REGION2                     ((OTFDEC_Region_TypeDef *) OTFDEC2_REGION2_BASE)
#define OTFDEC2_REGION3                     ((OTFDEC_Region_TypeDef *) OTFDEC2_REGION3_BASE)
#define OTFDEC2_REGION4                     ((OTFDEC_Region_TypeDef *) OTFDEC2_REGION4_BASE)
#define IPCC1                               ((IPCC_TypeDef *) IPCC1_BASE)
#define IPCC1_C1                            ((IPCC_CommonTypeDef *) IPCC1_C1_BASE)
#define IPCC1_C2                            ((IPCC_CommonTypeDef *) IPCC1_C2_BASE)
#define DCMI                                ((DCMI_TypeDef *) DCMI_BASE)
#define PSSI                                ((PSSI_TypeDef *) PSSI_BASE)
#define CRC                                 ((CRC_TypeDef *) CRC_BASE)
#define MDF1                                ((MDF_TypeDef *) MDF1_BASE)
#define MDF1_Filter0                        ((MDF_Filter_TypeDef*) MDF1_Filter0_BASE)
#define MDF1_Filter1                        ((MDF_Filter_TypeDef*) MDF1_Filter1_BASE)
#define MDF1_Filter2                        ((MDF_Filter_TypeDef*) MDF1_Filter2_BASE)
#define MDF1_Filter3                        ((MDF_Filter_TypeDef*) MDF1_Filter3_BASE)
#define MDF1_Filter4                        ((MDF_Filter_TypeDef*) MDF1_Filter4_BASE)
#define MDF1_Filter5                        ((MDF_Filter_TypeDef*) MDF1_Filter5_BASE)
#define MDF1_Filter6                        ((MDF_Filter_TypeDef*) MDF1_Filter6_BASE)
#define MDF1_Filter7                        ((MDF_Filter_TypeDef*) MDF1_Filter7_BASE)
#define ADC1                                ((ADC_TypeDef *) ADC1_BASE)
#define ADC2                                ((ADC_TypeDef *) ADC2_BASE)
#define ADC1_COMMON                         ((ADC_Common_TypeDef *) ADC1_COMMON_BASE)
#define ADC2_COMMON                         ((ADC_Common_TypeDef *) ADC2_COMMON_BASE)

#define HPDMA1_Channel0                     ((DMA_Channel_TypeDef *) HPDMA1_Channel0_BASE)
#define HPDMA1_Channel1                     ((DMA_Channel_TypeDef *) HPDMA1_Channel1_BASE)
#define HPDMA1_Channel2                     ((DMA_Channel_TypeDef *) HPDMA1_Channel2_BASE)
#define HPDMA1_Channel3                     ((DMA_Channel_TypeDef *) HPDMA1_Channel3_BASE)
#define HPDMA1_Channel4                     ((DMA_Channel_TypeDef *) HPDMA1_Channel4_BASE)
#define HPDMA1_Channel5                     ((DMA_Channel_TypeDef *) HPDMA1_Channel5_BASE)
#define HPDMA1_Channel6                     ((DMA_Channel_TypeDef *) HPDMA1_Channel6_BASE)
#define HPDMA1_Channel7                     ((DMA_Channel_TypeDef *) HPDMA1_Channel7_BASE)
#define HPDMA1_Channel8                     ((DMA_Channel_TypeDef *) HPDMA1_Channel8_BASE)
#define HPDMA1_Channel9                     ((DMA_Channel_TypeDef *) HPDMA1_Channel9_BASE)
#define HPDMA1_Channel10                    ((DMA_Channel_TypeDef *) HPDMA1_Channel10_BASE)
#define HPDMA1_Channel11                    ((DMA_Channel_TypeDef *) HPDMA1_Channel11_BASE)
#define HPDMA1_Channel12                    ((DMA_Channel_TypeDef *) HPDMA1_Channel12_BASE)
#define HPDMA1_Channel13                    ((DMA_Channel_TypeDef *) HPDMA1_Channel13_BASE)
#define HPDMA1_Channel14                    ((DMA_Channel_TypeDef *) HPDMA1_Channel14_BASE)
#define HPDMA1_Channel15                    ((DMA_Channel_TypeDef *) HPDMA1_Channel15_BASE)

