zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211cxx_ca35.h
/*******************  Bit definition for BSEC_WDR register  *******************/
#define BSEC_WDR_WRDATA_Pos           (0U)
#define BSEC_WDR_WRDATA_Msk            (0xFFFFFFFFUL << BSEC_WDR_WRDATA_Pos)        /*!< 0xFFFFFFFF */
#define BSEC_WDR_WRDATA               BSEC_WDR_WRDATA_Msk                     /*!< OTP write data */

/*****************  Bit definition for BSEC_SRDATAR register  *****************/
#define BSEC_SRDATAR_SRDATA_Pos       (0U)
#define BSEC_SRDATAR_SRDATA_Msk       (0xFFFFFFFFUL << BSEC_SRDATAR_SRDATA_Pos)/*!< 0xFFFFFFFF */
#define BSEC_SRDATAR_SRDATA           BSEC_SRDATAR_SRDATA_Msk                 /*!< Supplementary read data */

/****************  Bit definition for BSEC_SCRATCHRx register  ****************/
#define BSEC_SCRATCHRx_SDATA_Pos       (0U)
#define BSEC_SCRATCHRx_SDATA_Msk       (0xFFFFFFFFUL << BSEC_SCRATCHRx_SDATA_Pos)   /*!< 0xFFFFFFFF */
#define BSEC_SCRATCHRx_SDATA           BSEC_SCRATCHRx_SDATA_Msk                    /*!< Scratch data */

/******************  Bit definition for BSEC_LOCKR register  ******************/
#define BSEC_LOCKR_GWLOCK_Pos         (0U)
#define BSEC_LOCKR_GWLOCK_Msk          (0x1UL << BSEC_LOCKR_GWLOCK_Pos)             /*!< 0x00000001 */
#define BSEC_LOCKR_GWLOCK             BSEC_LOCKR_GWLOCK_Msk                   /*!< Global write lock */
#define BSEC_LOCKR_DENLOCK_Pos        (1U)
#define BSEC_LOCKR_DENLOCK_Msk        (0x1UL << BSEC_LOCKR_DENLOCK_Pos)        /*!< 0x00000002 */
#define BSEC_LOCKR_DENLOCK            BSEC_LOCKR_DENLOCK_Msk                  /*!< Debug enable register sticky lock */
#define BSEC_LOCKR_HKLOCK_Pos         (2U)
#define BSEC_LOCKR_HKLOCK_Msk          (0x1UL << BSEC_LOCKR_HKLOCK_Pos)             /*!< 0x00000004 */
#define BSEC_LOCKR_HKLOCK             BSEC_LOCKR_HKLOCK_Msk                   /*!< Hardware key lock */

/*****************  Bit definition for BSEC_JTAGINR register  *****************/
#define BSEC_JTAGINR_JDATAIN_Pos       (0U)
#define BSEC_JTAGINR_JDATAIN_Msk       (0xFFFFFFFFUL << BSEC_JTAGINR_JDATAIN_Pos)   /*!< 0xFFFFFFFF */
#define BSEC_JTAGINR_JDATAIN           BSEC_JTAGINR_JDATAIN_Msk                    /*!< JTAG input data */

/****************  Bit definition for BSEC_JTAGOUTR register  *****************/
#define BSEC_JTAGOUTR_JDATAOUT_Pos     (0U)
#define BSEC_JTAGOUTR_JDATAOUT_Msk     (0xFFFFFFFFUL << BSEC_JTAGOUTR_JDATAOUT_Pos) /*!< 0xFFFFFFFF */
#define BSEC_JTAGOUTR_JDATAOUT         BSEC_JTAGOUTR_JDATAOUT_Msk                  /*!< JTAG output data */

/******************  Bit definition for BSEC_DENR register  *******************/
#define BSEC_DENR_DBGENA_Pos          (1U)
#define BSEC_DENR_DBGENA_Msk          (0x1UL << BSEC_DENR_DBGENA_Pos)          /*!< 0x00000002 */
#define BSEC_DENR_DBGENA              BSEC_DENR_DBGENA_Msk                    /*!< Debug enable for Cortex A */
#define BSEC_DENR_NIDENA_Pos          (2U)
#define BSEC_DENR_NIDENA_Msk          (0x1UL << BSEC_DENR_NIDENA_Pos)          /*!< 0x00000004 */
#define BSEC_DENR_NIDENA              BSEC_DENR_NIDENA_Msk                    /*!< Non invasive debug enable for Cortex A */
#define BSEC_DENR_DEVICEEN_Pos        (3U)
#define BSEC_DENR_DEVICEEN_Msk        (0x1UL << BSEC_DENR_DEVICEEN_Pos)        /*!< 0x00000008 */
#define BSEC_DENR_DEVICEEN            BSEC_DENR_DEVICEEN_Msk                  /*!< Device debug enable */
#define BSEC_DENR_HDPEN_Pos           (4U)
#define BSEC_DENR_HDPEN_Msk           (0x1UL << BSEC_DENR_HDPEN_Pos)           /*!< 0x00000010 */
#define BSEC_DENR_HDPEN               BSEC_DENR_HDPEN_Msk                     /*!< Hardware debug port enable */
#define BSEC_DENR_SPIDENA_Pos         (5U)
#define BSEC_DENR_SPIDENA_Msk         (0x1UL << BSEC_DENR_SPIDENA_Pos)         /*!< 0x00000020 */
#define BSEC_DENR_SPIDENA             BSEC_DENR_SPIDENA_Msk                   /*!< Secure privilege invasive debug enable for Cortex A */
#define BSEC_DENR_SPNIDENA_Pos        (6U)
#define BSEC_DENR_SPNIDENA_Msk        (0x1UL << BSEC_DENR_SPNIDENA_Pos)        /*!< 0x00000040 */
#define BSEC_DENR_SPNIDENA            BSEC_DENR_SPNIDENA_Msk                  /*!< Secure privilege non-invasive debug enable for Cortex A */
#define BSEC_DENR_DBGSWEN_Pos         (7U)
#define BSEC_DENR_DBGSWEN_Msk         (0x1UL << BSEC_DENR_DBGSWEN_Pos)         /*!< 0x00000080 */
#define BSEC_DENR_DBGSWEN             BSEC_DENR_DBGSWEN_Msk                   /*!< Self-hosted debug enable */
#define BSEC_DENR_DBGENM_Pos          (8U)
#define BSEC_DENR_DBGENM_Msk          (0x1UL << BSEC_DENR_DBGENM_Pos)          /*!< 0x00000100 */
#define BSEC_DENR_DBGENM              BSEC_DENR_DBGENM_Msk                    /*!< Debug enable for Cortex M */
#define BSEC_DENR_NIDENM_Pos          (9U)
#define BSEC_DENR_NIDENM_Msk          (0x1UL << BSEC_DENR_NIDENM_Pos)          /*!< 0x00000200 */
#define BSEC_DENR_NIDENM              BSEC_DENR_NIDENM_Msk                    /*!< Non invasive debug enable for Cortex M */
#define BSEC_DENR_SPIDENM_Pos         (10U)
#define BSEC_DENR_SPIDENM_Msk         (0x1UL << BSEC_DENR_SPIDENM_Pos)         /*!< 0x00000400 */
#define BSEC_DENR_SPIDENM             BSEC_DENR_SPIDENM_Msk                   /*!< Secure privilege invasive debug enable for Cortex M */
#define BSEC_DENR_SPNIDENM_Pos        (11U)
#define BSEC_DENR_SPNIDENM_Msk        (0x1UL << BSEC_DENR_SPNIDENM_Pos)        /*!< 0x00000800 */
#define BSEC_DENR_SPNIDENM            BSEC_DENR_SPNIDENM_Msk                  /*!< Secure privilege non-invasive debug enable for Cortex M */
#define BSEC_DENR_RCODE0_Pos            (12U)
#define BSEC_DENR_RCODE0_Msk            (0x1UL << BSEC_DENR_RCODE0_Pos)            /*!< 0x00001000 */
#define BSEC_DENR_RCODE0                BSEC_DENR_RCODE0_Msk                      /*!< SECDED code */
#define BSEC_DENR_RCODE1_Pos            (13U)
#define BSEC_DENR_RCODE1_Msk            (0x1UL << BSEC_DENR_RCODE1_Pos)            /*!< 0x00002000 */
#define BSEC_DENR_RCODE1                BSEC_DENR_RCODE1_Msk                      /*!< SECDED code */
#define BSEC_DENR_RCODE2_Pos            (14U)
#define BSEC_DENR_RCODE2_Msk            (0x1UL << BSEC_DENR_RCODE2_Pos)            /*!< 0x00004000 */
#define BSEC_DENR_RCODE2                BSEC_DENR_RCODE2_Msk                      /*!< SECDED code */
#define BSEC_DENR_RCODE3_Pos            (15U)
#define BSEC_DENR_RCODE3_Msk            (0x1UL << BSEC_DENR_RCODE3_Pos)            /*!< 0x00008000 */
#define BSEC_DENR_RCODE3                BSEC_DENR_RCODE3_Msk                      /*!< SECDED code */
#define BSEC_DENR_RCODE4_Pos            (16U)
#define BSEC_DENR_RCODE4_Msk            (0x1UL << BSEC_DENR_RCODE4_Pos)            /*!< 0x00010000 */
#define BSEC_DENR_RCODE4                BSEC_DENR_RCODE4_Msk                      /*!< SECDED code */
#define BSEC_DENR_RCODE5_Pos            (17U)
#define BSEC_DENR_RCODE5_Msk            (0x1UL << BSEC_DENR_RCODE5_Pos)            /*!< 0x00020000 */
#define BSEC_DENR_RCODE5                BSEC_DENR_RCODE5_Msk                      /*!< SECDED code */
#define BSEC_DENR_PATTERN_Pos           (20U)
#define BSEC_DENR_PATTERN_Msk           (0xFFFUL << BSEC_DENR_PATTERN_Pos)         /*!< 0xFFF00000 */
#define BSEC_DENR_PATTERN               BSEC_DENR_PATTERN_Msk                     /*!< Pattern to validate write data value */

