zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211cxx_ca35.h
/********************  Bit definition for APB1FZ register  ********************/
#define DBGMCU_APB1FZ_DBG_TIM2_STOP_Pos             (0U)
#define DBGMCU_APB1FZ_DBG_TIM2_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_TIM2_STOP_Pos)           /*!< 0x00000001 */
#define DBGMCU_APB1FZ_DBG_TIM2_STOP                 DBGMCU_APB1FZ_DBG_TIM2_STOP_Msk                     /*!< TIM2 suspend in debug */
#define DBGMCU_APB1FZ_DBG_TIM3_STOP_Pos             (1U)
#define DBGMCU_APB1FZ_DBG_TIM3_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_TIM3_STOP_Pos)           /*!< 0x00000002 */
#define DBGMCU_APB1FZ_DBG_TIM3_STOP                 DBGMCU_APB1FZ_DBG_TIM3_STOP_Msk                     /*!< TIM3 suspend in debug */
#define DBGMCU_APB1FZ_DBG_TIM4_STOP_Pos             (2U)
#define DBGMCU_APB1FZ_DBG_TIM4_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_TIM4_STOP_Pos)           /*!< 0x00000004 */
#define DBGMCU_APB1FZ_DBG_TIM4_STOP                 DBGMCU_APB1FZ_DBG_TIM4_STOP_Msk                     /*!< TIM4 suspend in debug */
#define DBGMCU_APB1FZ_DBG_TIM5_STOP_Pos             (3U)
#define DBGMCU_APB1FZ_DBG_TIM5_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_TIM5_STOP_Pos)           /*!< 0x00000008 */
#define DBGMCU_APB1FZ_DBG_TIM5_STOP                 DBGMCU_APB1FZ_DBG_TIM5_STOP_Msk                     /*!< TIM5 suspend in debug */
#define DBGMCU_APB1FZ_DBG_TIM6_STOP_Pos             (4U)
#define DBGMCU_APB1FZ_DBG_TIM6_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_TIM6_STOP_Pos)           /*!< 0x00000010 */
#define DBGMCU_APB1FZ_DBG_TIM6_STOP                 DBGMCU_APB1FZ_DBG_TIM6_STOP_Msk                     /*!< TIM6 suspend in debug */
#define DBGMCU_APB1FZ_DBG_TIM7_STOP_Pos             (5U)
#define DBGMCU_APB1FZ_DBG_TIM7_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_TIM7_STOP_Pos)           /*!< 0x00000020 */
#define DBGMCU_APB1FZ_DBG_TIM7_STOP                 DBGMCU_APB1FZ_DBG_TIM7_STOP_Msk                     /*!< TIM7 suspend in debug */
#define DBGMCU_APB1FZ_DBG_TIM12_STOP_Pos            (6U)
#define DBGMCU_APB1FZ_DBG_TIM12_STOP_Msk            (0x1UL << DBGMCU_APB1FZ_DBG_TIM12_STOP_Pos)          /*!< 0x00000040 */
#define DBGMCU_APB1FZ_DBG_TIM12_STOP                DBGMCU_APB1FZ_DBG_TIM12_STOP_Msk                    /*!< TIM12 suspend in debug */
#define DBGMCU_APB1FZ_DBG_TIM13_STOP_Pos            (7U)
#define DBGMCU_APB1FZ_DBG_TIM13_STOP_Msk            (0x1UL << DBGMCU_APB1FZ_DBG_TIM13_STOP_Pos)          /*!< 0x00000080 */
#define DBGMCU_APB1FZ_DBG_TIM13_STOP                DBGMCU_APB1FZ_DBG_TIM13_STOP_Msk                    /*!< TIM13 suspend in debug */
#define DBGMCU_APB1FZ_DBG_TIM14_STOP_Pos            (8U)
#define DBGMCU_APB1FZ_DBG_TIM14_STOP_Msk            (0x1UL << DBGMCU_APB1FZ_DBG_TIM14_STOP_Pos)          /*!< 0x00000100 */
#define DBGMCU_APB1FZ_DBG_TIM14_STOP                DBGMCU_APB1FZ_DBG_TIM14_STOP_Msk                    /*!< TIM14 suspend in debug */
#define DBGMCU_APB1FZ_DBG_LPTIM1_STOP_Pos           (9U)
#define DBGMCU_APB1FZ_DBG_LPTIM1_STOP_Msk           (0x1UL << DBGMCU_APB1FZ_DBG_LPTIM1_STOP_Pos)         /*!< 0x00000200 */
#define DBGMCU_APB1FZ_DBG_LPTIM1_STOP               DBGMCU_APB1FZ_DBG_LPTIM1_STOP_Msk                   /*!< LPTIM1 suspend in debug */
#define DBGMCU_APB1FZ_DBG_LPTIM2_STOP_Pos           (10U)
#define DBGMCU_APB1FZ_DBG_LPTIM2_STOP_Msk           (0x1UL << DBGMCU_APB1FZ_DBG_LPTIM2_STOP_Pos)         /*!< 0x00000400 */
#define DBGMCU_APB1FZ_DBG_LPTIM2_STOP               DBGMCU_APB1FZ_DBG_LPTIM2_STOP_Msk                   /*!< LPTIM2 suspend in debug */
#define DBGMCU_APB1FZ_DBG_I2C1_STOP_Pos             (18U)
#define DBGMCU_APB1FZ_DBG_I2C1_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_I2C1_STOP_Pos)           /*!< 0x00040000 */
#define DBGMCU_APB1FZ_DBG_I2C1_STOP                 DBGMCU_APB1FZ_DBG_I2C1_STOP_Msk                     /*!< I2C1 SMBUS timeout suspend in debug */
#define DBGMCU_APB1FZ_DBG_I2C2_STOP_Pos             (19U)
#define DBGMCU_APB1FZ_DBG_I2C2_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_I2C2_STOP_Pos)           /*!< 0x00080000 */
#define DBGMCU_APB1FZ_DBG_I2C2_STOP                 DBGMCU_APB1FZ_DBG_I2C2_STOP_Msk                     /*!< I2C2 SMBUS timeout suspend in debug */
#define DBGMCU_APB1FZ_DBG_I2C3_STOP_Pos             (20U)
#define DBGMCU_APB1FZ_DBG_I2C3_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_I2C3_STOP_Pos)           /*!< 0x00100000 */
#define DBGMCU_APB1FZ_DBG_I2C3_STOP                 DBGMCU_APB1FZ_DBG_I2C3_STOP_Msk                     /*!< I2C3 SMBUS timeout suspend in debug */
#define DBGMCU_APB1FZ_DBG_I2C4_STOP_Pos             (21U)
#define DBGMCU_APB1FZ_DBG_I2C4_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_I2C4_STOP_Pos)           /*!< 0x00200000 */
#define DBGMCU_APB1FZ_DBG_I2C4_STOP                 DBGMCU_APB1FZ_DBG_I2C4_STOP_Msk                     /*!< I2C4 SMBUS timeout suspend in debug */
#define DBGMCU_APB1FZ_DBG_I2C5_STOP_Pos             (22U)
#define DBGMCU_APB1FZ_DBG_I2C5_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_I2C5_STOP_Pos)           /*!< 0x00400000 */
#define DBGMCU_APB1FZ_DBG_I2C5_STOP                 DBGMCU_APB1FZ_DBG_I2C5_STOP_Msk                     /*!< I2C5 SMBUS timeout suspend in debug */
#define DBGMCU_APB1FZ_DBG_I2C6_STOP_Pos             (23U)
#define DBGMCU_APB1FZ_DBG_I2C6_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_I2C6_STOP_Pos)           /*!< 0x00800000 */
#define DBGMCU_APB1FZ_DBG_I2C6_STOP                 DBGMCU_APB1FZ_DBG_I2C6_STOP_Msk                     /*!< I2C6 SMBUS timeout suspend in debug */
#define DBGMCU_APB1FZ_DBG_I2C7_STOP_Pos             (24U)
#define DBGMCU_APB1FZ_DBG_I2C7_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_I2C7_STOP_Pos)           /*!< 0x01000000 */
#define DBGMCU_APB1FZ_DBG_I2C7_STOP                 DBGMCU_APB1FZ_DBG_I2C7_STOP_Msk                     /*!< I2C7 SMBUS timeout suspend in debug */
#define DBGMCU_APB1FZ_DBG_I3C1_STOP_Pos             (25U)
#define DBGMCU_APB1FZ_DBG_I3C1_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_I3C1_STOP_Pos)           /*!< 0x02000000 */
#define DBGMCU_APB1FZ_DBG_I3C1_STOP                 DBGMCU_APB1FZ_DBG_I3C1_STOP_Msk                     /*!< I3C1 SMBUS timeout suspend in debug */
#define DBGMCU_APB1FZ_DBG_I3C2_STOP_Pos             (26U)
#define DBGMCU_APB1FZ_DBG_I3C2_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_I3C2_STOP_Pos)           /*!< 0x04000000 */
#define DBGMCU_APB1FZ_DBG_I3C2_STOP                 DBGMCU_APB1FZ_DBG_I3C2_STOP_Msk                     /*!< I3C2 SMBUS timeout suspend in debug */
#define DBGMCU_APB1FZ_DBG_I3C3_STOP_Pos             (27U)
#define DBGMCU_APB1FZ_DBG_I3C3_STOP_Msk             (0x1UL << DBGMCU_APB1FZ_DBG_I3C3_STOP_Pos)           /*!< 0x08000000 */
#define DBGMCU_APB1FZ_DBG_I3C3_STOP                 DBGMCU_APB1FZ_DBG_I3C3_STOP_Msk                     /*!< I3C3 SMBUS timeout suspend in debug */
#define DBGMCU_APB1FZ_DBG_TIM10_STOP_Pos            (28U)
#define DBGMCU_APB1FZ_DBG_TIM10_STOP_Msk            (0x1UL << DBGMCU_APB1FZ_DBG_TIM10_STOP_Pos)          /*!< 0x1000000 */
#define DBGMCU_APB1FZ_DBG_TIM10_STOP                DBGMCU_APB1FZ_DBG_TIM10_STOP_Msk                    /*!< TIM10 suspend in debug */
#define DBGMCU_APB1FZ_DBG_TIM11_STOP_Pos            (29U)
#define DBGMCU_APB1FZ_DBG_TIM11_STOP_Msk            (0x1UL << DBGMCU_APB1FZ_DBG_TIM11_STOP_Pos)          /*!< 0x20000000 */
#define DBGMCU_APB1FZ_DBG_TIM11_STOP                DBGMCU_APB1FZ_DBG_TIM11_STOP_Msk                    /*!< TIM11 suspend in debug */

/********************  Bit definition for APB2FZ register  ********************/
#define DBGMCU_APB2FZ_DBG_TIM1_STOP_Pos             (0U)
#define DBGMCU_APB2FZ_DBG_TIM1_STOP_Msk             (0x1UL << DBGMCU_APB2FZ_DBG_TIM1_STOP_Pos)           /*!< 0x00000001 */
#define DBGMCU_APB2FZ_DBG_TIM1_STOP                 DBGMCU_APB2FZ_DBG_TIM1_STOP_Msk                     /*!< TIM1 suspend in debug */
#define DBGMCU_APB2FZ_DBG_TIM8_STOP_Pos             (1U)
#define DBGMCU_APB2FZ_DBG_TIM8_STOP_Msk             (0x1UL << DBGMCU_APB2FZ_DBG_TIM8_STOP_Pos)           /*!< 0x00000002 */
#define DBGMCU_APB2FZ_DBG_TIM8_STOP                 DBGMCU_APB2FZ_DBG_TIM8_STOP_Msk                     /*!< TIM8 suspend in debug */
#define DBGMCU_APB2FZ_DBG_TIM15_STOP_Pos            (5U)
#define DBGMCU_APB2FZ_DBG_TIM15_STOP_Msk            (0x1UL << DBGMCU_APB2FZ_DBG_TIM15_STOP_Pos)          /*!< 0x00000020 */
#define DBGMCU_APB2FZ_DBG_TIM15_STOP                DBGMCU_APB2FZ_DBG_TIM15_STOP_Msk                    /*!< TIM15 suspend in debug */
#define DBGMCU_APB2FZ_DBG_TIM16_STOP_Pos            (6U)
#define DBGMCU_APB2FZ_DBG_TIM16_STOP_Msk            (0x1UL << DBGMCU_APB2FZ_DBG_TIM16_STOP_Pos)          /*!< 0x00000040 */
#define DBGMCU_APB2FZ_DBG_TIM16_STOP                DBGMCU_APB2FZ_DBG_TIM16_STOP_Msk                    /*!< TIM16 suspend in debug */
#define DBGMCU_APB2FZ_DBG_TIM17_STOP_Pos            (7U)
#define DBGMCU_APB2FZ_DBG_TIM17_STOP_Msk            (0x1UL << DBGMCU_APB2FZ_DBG_TIM17_STOP_Pos)          /*!< 0x00000080 */
#define DBGMCU_APB2FZ_DBG_TIM17_STOP                DBGMCU_APB2FZ_DBG_TIM17_STOP_Msk                    /*!< TIM17 suspend in debug */
#define DBGMCU_APB2FZ_DBG_FDCAN_STOP_Pos            (13U)
#define DBGMCU_APB2FZ_DBG_FDCAN_STOP_Msk            (0x1UL << DBGMCU_APB2FZ_DBG_FDCAN_STOP_Pos)          /*!< 0x00002000 */
#define DBGMCU_APB2FZ_DBG_FDCAN_STOP                DBGMCU_APB2FZ_DBG_FDCAN_STOP_Msk                    /*!< FDCAN suspend in debug */
#define DBGMCU_APB2FZ_DBG_TIM20_STOP_Pos            (18U)
#define DBGMCU_APB2FZ_DBG_TIM20_STOP_Msk            (0x1UL << DBGMCU_APB2FZ_DBG_TIM20_STOP_Pos)          /*!< 0x00040000 */
#define DBGMCU_APB2FZ_DBG_TIM20_STOP                DBGMCU_APB2FZ_DBG_TIM20_STOP_Msk                    /*!< TIM20 suspend in debug */

/********************  Bit definition for APB3FZ register  ********************/
#define DBGMCU_APB3FZ_DBG_IWDG1_STOP_Pos            (1U)
#define DBGMCU_APB3FZ_DBG_IWDG1_STOP_Msk            (0x1UL << DBGMCU_APB3FZ_DBG_IWDG1_STOP_Pos)          /*!< 0x00000002 */
#define DBGMCU_APB3FZ_DBG_IWDG1_STOP                DBGMCU_APB3FZ_DBG_IWDG1_STOP_Msk                    /*!< IWDG1 suspend in debug */
#define DBGMCU_APB3FZ_DBG_IWDG2_STOP_Pos            (2U)
#define DBGMCU_APB3FZ_DBG_IWDG2_STOP_Msk            (0x1UL << DBGMCU_APB3FZ_DBG_IWDG2_STOP_Pos)          /*!< 0x00000004 */
#define DBGMCU_APB3FZ_DBG_IWDG2_STOP                DBGMCU_APB3FZ_DBG_IWDG2_STOP_Msk                    /*!< IWDG2 suspend in debug */
#define DBGMCU_APB3FZ_DBG_IWDG3_STOP_Pos            (3U)
#define DBGMCU_APB3FZ_DBG_IWDG3_STOP_Msk            (0x1UL << DBGMCU_APB3FZ_DBG_IWDG3_STOP_Pos)          /*!< 0x00000008 */
#define DBGMCU_APB3FZ_DBG_IWDG3_STOP                DBGMCU_APB3FZ_DBG_IWDG3_STOP_Msk                    /*!< IWDG3 suspend in debug */
#define DBGMCU_APB3FZ_DBG_IWDG4_STOP_Pos            (4U)
#define DBGMCU_APB3FZ_DBG_IWDG4_STOP_Msk            (0x1UL << DBGMCU_APB3FZ_DBG_IWDG4_STOP_Pos)          /*!< 0x00000010 */
#define DBGMCU_APB3FZ_DBG_IWDG4_STOP                DBGMCU_APB3FZ_DBG_IWDG4_STOP_Msk                    /*!< IWDG4 suspend in debug */
#define DBGMCU_APB3FZ_DBG_WWDG1_STOP_Pos            (5U)
#define DBGMCU_APB3FZ_DBG_WWDG1_STOP_Msk            (0x1UL << DBGMCU_APB3FZ_DBG_WWDG1_STOP_Pos)          /*!< 0x00000020 */
#define DBGMCU_APB3FZ_DBG_WWDG1_STOP                DBGMCU_APB3FZ_DBG_WWDG1_STOP_Msk                    /*!< WWDG1 suspend in debug */

