zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211cxx_ca35.h
/**************  Bit definition for HASH_HWCFGR register  ***************/
#define HASH_HWCFGR_CFG1_Pos         (0U)
#define HASH_HWCFGR_CFG1_Msk         (0xFUL << HASH_HWCFGR_CFG1_Pos)            /*!< 0x0000000F */
#define HASH_HWCFGR_CFG1             HASH_HWCFGR_CFG1_Msk                      /*!< HW Generic 1 */
#define HASH_HWCFGR_CFG2_Pos         (4U)
#define HASH_HWCFGR_CFG2_Msk         (0xFUL << HASH_HWCFGR_CFG2_Pos)            /*!< 0x000000F0 */
#define HASH_HWCFGR_CFG2             HASH_HWCFGR_CFG2_Msk                      /*!< HW Generic 2 */
#define HASH_HWCFGR_CFG3_Pos         (8U)
#define HASH_HWCFGR_CFG3_Msk         (0xFUL << HASH_HWCFGR_CFG3_Pos)            /*!< 0x00000F00 */
#define HASH_HWCFGR_CFG3             HASH_HWCFGR_CFG3_Msk                      /*!< HW Generic 3 */
#define HASH_HWCFGR_CFG4_Pos         (12U)
#define HASH_HWCFGR_CFG4_Msk         (0xFUL << HASH_HWCFGR_CFG4_Pos)            /*!< 0x0000F000 */
#define HASH_HWCFGR_CFG4             HASH_HWCFGR_CFG4_Msk                      /*!< HW Generic 4 */
#define HASH_HWCFGR_CFG5_Pos         (16U)
#define HASH_HWCFGR_CFG5_Msk         (0xFUL << HASH_HWCFGR_CFG5_Pos)            /*!< 0x000F0000 */
#define HASH_HWCFGR_CFG5             HASH_HWCFGR_CFG5_Msk                      /*!< HW Generic 5 */

/***************  Bit definition for HASH_VERR register  ****************/
#define HASH_VERR_MINREV_Pos         (0U)
#define HASH_VERR_MINREV_Msk         (0xFUL << HASH_VERR_MINREV_Pos)            /*!< 0x0000000F */
#define HASH_VERR_MINREV             HASH_VERR_MINREV_Msk                      /*!< Minor revision */
#define HASH_VERR_MAJREV_Pos         (4U)
#define HASH_VERR_MAJREV_Msk         (0xFUL << HASH_VERR_MAJREV_Pos)            /*!< 0x000000F0 */
#define HASH_VERR_MAJREV             HASH_VERR_MAJREV_Msk                      /*!< Major revision */

/******************  Bit definition for HASH_IPIDR register  ******************/
#define HASH_IPIDR_ID_Pos            (0U)
#define HASH_IPIDR_ID_Msk            (0xFFFFFFFFUL << HASH_IPIDR_ID_Pos)        /*!< 0xFFFFFFFF */
#define HASH_IPIDR_ID                HASH_IPIDR_ID_Msk                         /*!< Identifier */

/******************  Bit definition for HASH_SIDR register  *******************/
#define HASH_SIDR_SID_Pos            (0U)
#define HASH_SIDR_SID_Msk            (0xFFFFFFFFUL << HASH_SIDR_SID_Pos)        /*!< 0xFFFFFFFF */
#define HASH_SIDR_SID                HASH_SIDR_SID_Msk                         /*!< Size identification code */

/******************************************************************************/
/*                                                                            */
/*                                    (HDP)                                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for HDP_CTRL register  *******************/
#define HDP_CTRL_EN_Pos             (0U)
#define HDP_CTRL_EN_Msk             (0x1UL << HDP_CTRL_EN_Pos)               /*!< 0x00000001 */
#define HDP_CTRL_EN                 HDP_CTRL_EN_Msk                         /*!< Enable HDP, valid if enabled in BSEC */

/*******************  Bit definition for HDP_MUX register  ********************/
#define HDP_MUX_MUX0_Pos          (0U)
#define HDP_MUX_MUX0_Msk          (0xFUL << HDP_MUX_MUX0_Pos)                /*!< 0x0000000F */
#define HDP_MUX_MUX0              HDP_MUX_MUX0_Msk                          /*!< Select the HDP0 output among the 16 available signals */
#define HDP_MUX_MUX0_0            (0x1UL << HDP_MUX_MUX0_Pos)                /*!< 0x00000001 */
#define HDP_MUX_MUX0_1            (0x2UL << HDP_MUX_MUX0_Pos)                /*!< 0x00000002 */
#define HDP_MUX_MUX0_2            (0x4UL << HDP_MUX_MUX0_Pos)                /*!< 0x00000004 */
#define HDP_MUX_MUX0_3            (0x8UL << HDP_MUX_MUX0_Pos)                /*!< 0x00000008 */
#define HDP_MUX_MUX1_Pos          (4U)
#define HDP_MUX_MUX1_Msk          (0xFUL << HDP_MUX_MUX1_Pos)                /*!< 0x000000F0 */
#define HDP_MUX_MUX1              HDP_MUX_MUX1_Msk                          /*!< Select the HDP1 output among the 16 available signals */
#define HDP_MUX_MUX1_0            (0x1UL << HDP_MUX_MUX1_Pos)                /*!< 0x00000010 */
#define HDP_MUX_MUX1_1            (0x2UL << HDP_MUX_MUX1_Pos)                /*!< 0x00000020 */
#define HDP_MUX_MUX1_2            (0x4UL << HDP_MUX_MUX1_Pos)                /*!< 0x00000040 */
#define HDP_MUX_MUX1_3            (0x8UL << HDP_MUX_MUX1_Pos)                /*!< 0x00000080 */
#define HDP_MUX_MUX2_Pos          (8U)
#define HDP_MUX_MUX2_Msk          (0xFUL << HDP_MUX_MUX2_Pos)                /*!< 0x00000F00 */
#define HDP_MUX_MUX2              HDP_MUX_MUX2_Msk                          /*!< Select the HDP2 output among the 16 available signals */
#define HDP_MUX_MUX2_0            (0x1UL << HDP_MUX_MUX2_Pos)                /*!< 0x00000100 */
#define HDP_MUX_MUX2_1            (0x2UL << HDP_MUX_MUX2_Pos)                /*!< 0x00000200 */
#define HDP_MUX_MUX2_2            (0x4UL << HDP_MUX_MUX2_Pos)                /*!< 0x00000400 */
#define HDP_MUX_MUX2_3            (0x8UL << HDP_MUX_MUX2_Pos)                /*!< 0x00000800 */
#define HDP_MUX_MUX3_Pos          (12U)
#define HDP_MUX_MUX3_Msk          (0xFUL << HDP_MUX_MUX3_Pos)                /*!< 0x0000F000 */
#define HDP_MUX_MUX3              HDP_MUX_MUX3_Msk                          /*!< Select the HDP3 output among the 16 available signals */
#define HDP_MUX_MUX3_0            (0x1UL << HDP_MUX_MUX3_Pos)                /*!< 0x00001000 */
#define HDP_MUX_MUX3_1            (0x2UL << HDP_MUX_MUX3_Pos)                /*!< 0x00002000 */
#define HDP_MUX_MUX3_2            (0x4UL << HDP_MUX_MUX3_Pos)                /*!< 0x00004000 */
#define HDP_MUX_MUX3_3            (0x8UL << HDP_MUX_MUX3_Pos)                /*!< 0x00008000 */
#define HDP_MUX_MUX4_Pos          (16U)
#define HDP_MUX_MUX4_Msk          (0xFUL << HDP_MUX_MUX4_Pos)                /*!< 0x000F0000 */
#define HDP_MUX_MUX4              HDP_MUX_MUX4_Msk                          /*!< Select the HDP4 output among the 16 available signals */
#define HDP_MUX_MUX4_0            (0x1UL << HDP_MUX_MUX4_Pos)                /*!< 0x00010000 */
#define HDP_MUX_MUX4_1            (0x2UL << HDP_MUX_MUX4_Pos)                /*!< 0x00020000 */
#define HDP_MUX_MUX4_2            (0x4UL << HDP_MUX_MUX4_Pos)                /*!< 0x00040000 */
#define HDP_MUX_MUX4_3            (0x8UL << HDP_MUX_MUX4_Pos)                /*!< 0x00080000 */
#define HDP_MUX_MUX5_Pos          (20U)
#define HDP_MUX_MUX5_Msk          (0xFUL << HDP_MUX_MUX5_Pos)                /*!< 0x00F00000 */
#define HDP_MUX_MUX5              HDP_MUX_MUX5_Msk                          /*!< Select the HDP5 output among the 16 available signals */
#define HDP_MUX_MUX5_0            (0x1UL << HDP_MUX_MUX5_Pos)                /*!< 0x00100000 */
#define HDP_MUX_MUX5_1            (0x2UL << HDP_MUX_MUX5_Pos)                /*!< 0x00200000 */
#define HDP_MUX_MUX5_2            (0x4UL << HDP_MUX_MUX5_Pos)                /*!< 0x00400000 */
#define HDP_MUX_MUX5_3            (0x8UL << HDP_MUX_MUX5_Pos)                /*!< 0x00800000 */
#define HDP_MUX_MUX6_Pos          (24U)
#define HDP_MUX_MUX6_Msk          (0xFUL << HDP_MUX_MUX6_Pos)                /*!< 0x0F000000 */
#define HDP_MUX_MUX6              HDP_MUX_MUX6_Msk                          /*!< Select the HDP6 output among the 16 available signals */
#define HDP_MUX_MUX6_0            (0x1UL << HDP_MUX_MUX6_Pos)                /*!< 0x01000000 */
#define HDP_MUX_MUX6_1            (0x2UL << HDP_MUX_MUX6_Pos)                /*!< 0x02000000 */
#define HDP_MUX_MUX6_2            (0x4UL << HDP_MUX_MUX6_Pos)                /*!< 0x04000000 */
#define HDP_MUX_MUX6_3            (0x8UL << HDP_MUX_MUX6_Pos)                /*!< 0x08000000 */
#define HDP_MUX_MUX7_Pos          (28U)
#define HDP_MUX_MUX7_Msk          (0xFUL << HDP_MUX_MUX7_Pos)                /*!< 0xF0000000 */
#define HDP_MUX_MUX7              HDP_MUX_MUX7_Msk                          /*!< Select the HDP7 output among the 16 available signals */
#define HDP_MUX_MUX7_0            (0x1UL << HDP_MUX_MUX7_Pos)                /*!< 0x10000000 */
#define HDP_MUX_MUX7_1            (0x2UL << HDP_MUX_MUX7_Pos)                /*!< 0x20000000 */
#define HDP_MUX_MUX7_2            (0x4UL << HDP_MUX_MUX7_Pos)                /*!< 0x40000000 */
#define HDP_MUX_MUX7_3            (0x8UL << HDP_MUX_MUX7_Pos)                /*!< 0x80000000 */

/*******************  Bit definition for HDP_VAL register  ********************/
#define HDP_VAL_HDPVAL_Pos          (0U)
#define HDP_VAL_HDPVAL_Msk          (0xFFUL << HDP_VAL_HDPVAL_Pos)           /*!< 0x000000FF */
#define HDP_VAL_HDPVAL              HDP_VAL_HDPVAL_Msk                      /*!< Value of the HDP signals */

