zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211cxx_ca35.h
/*******************  Bits definition for RISAF_REGx_zCFGR register ***********/
#define RISAF_REGZCFGR_SREN_Pos       (0U)
#define RISAF_REGZCFGR_SREN_Msk       (0x1UL << RISAF_REGZCFGR_SREN_Pos)         /*!< 0x00000001 */
#define RISAF_REGZCFGR_SREN           RISAF_REGZCFGR_SREN_Msk

#define RISAF_REGZCFGR_RLOCK_Pos      (1U)
#define RISAF_REGZCFGR_RLOCK_Msk      (0x1UL << RISAF_REGZCFGR_RLOCK_Pos)        /*!< 0x00000002 */
#define RISAF_REGZCFGR_RLOCK          RISAF_REGZCFGR_RLOCK_Msk

#define RISAF_REGZCFGR_SRCID_Pos      (4U)
#define RISAF_REGZCFGR_SRCID_Msk      (0x7UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000070 */
#define RISAF_REGZCFGR_SRCID          RISAF_REGZCFGR_SRCID_Msk
#define RISAF_REGZCFGR_SRCID0         (0x0UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000000 */
#define RISAF_REGZCFGR_SRCID1         (0x1UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000010 */
#define RISAF_REGZCFGR_SRCID2         (0x2UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000020 */
#define RISAF_REGZCFGR_SRCID3         (0x3UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000030 */
#define RISAF_REGZCFGR_SRCID4         (0x4UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000040 */
#define RISAF_REGZCFGR_SRCID5         (0x5UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000050 */
#define RISAF_REGZCFGR_SRCID6         (0x6UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000060 */
#define RISAF_REGZCFGR_SRCID7         (0x7UL << RISAF_REGZCFGR_SRCID_Pos)        /*!< 0x00000070 */

#define RISAF_REGZCFGR_SEC_Pos        (8U)
#define RISAF_REGZCFGR_SEC_Msk        (0x1UL << RISAF_REGZCFGR_SEC_Pos)          /*!< 0x00000100 */
#define RISAF_REGZCFGR_SEC            RISAF_REGZCFGR_SEC_Msk

#define RISAF_REGZCFGR_PRIV_Pos       (9U)
#define RISAF_REGZCFGR_PRIV_Msk       (0x1UL << RISAF_REGZCFGR_PRIV_Pos)         /*!< 0x00000200 */
#define RISAF_REGZCFGR_PRIV           RISAF_REGZCFGR_PRIV_Msk

#define RISAF_REGZCFGR_RDEN_Pos       (12U)
#define RISAF_REGZCFGR_RDEN_Msk       (0x1UL << RISAF_REGZCFGR_RDEN_Pos)         /*!< 0x00001000 */
#define RISAF_REGZCFGR_RDEN           RISAF_REGZCFGR_RDEN_Msk

#define RISAF_REGZCFGR_WREN_Pos       (13U)
#define RISAF_REGZCFGR_WREN_Msk       (0x1UL << RISAF_REGZCFGR_WREN_Pos)         /*!< 0x00002000 */
#define RISAF_REGZCFGR_WREN           RISAF_REGZCFGR_WREN_Msk

#define RISAF_REGZCFGR_ENC_Pos        (14U)
#define RISAF_REGZCFGR_ENC_Msk        (0x3UL << RISAF_REGZCFGR_ENC_Pos)          /*!< 0x0000C000 */
#define RISAF_REGZCFGR_ENC            RISAF_REGZCFGR_ENC_Msk

/*******************  Bits definition for RISAF_REGx_zSTARTR register *********/
#define RISAF_REGZSTARTR_SADDSTART_Pos (0U)
#define RISAF_REGZSTARTR_SADDSTART_Msk (0xFFFFFFFFUL << RISAF_REGZSTARTR_SADDSTART_Pos) /*!< 0xFFFFFFFF */
#define RISAF_REGZSTARTR_SADDSTART     RISAF_REGZSTARTR_SADDSTART_Msk

/*******************  Bits definition for RISAF_REGx_zENDR register ***********/
#define RISAF_REGZENDR_SADDEND_Pos    (0U)
#define RISAF_REGZENDR_SADDEND_Msk    (0xFFFFFFFFUL << RISAF_REGZENDR_SADDEND_Pos) /*!< 0xFFFFFFFF */
#define RISAF_REGZENDR_SADDEND        RISAF_REGZENDR_SADDEND_Msk

/*******************  Bits definition for RISAF_REGx_zNESTR register **********/
#define RISAF_REGZNESTR_DCEN_Pos      (2U)
#define RISAF_REGZNESTR_DCEN_Msk      (0x1UL << RISAF_REGZNESTR_DCEN_Pos)        /*!< 0x00000004 */
#define RISAF_REGZNESTR_DCEN          RISAF_REGZNESTR_DCEN_Msk

#define RISAF_REGZNESTR_DCCID_Pos     (4U)
#define RISAF_REGZNESTR_DCCID_Msk     (0x7UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000070 */
#define RISAF_REGZNESTR_DCCID         RISAF_REGZNESTR_DCCID_Msk
#define RISAF_REGZNESTR_DCCID0        (0x0UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000000 */
#define RISAF_REGZNESTR_DCCID1        (0x1UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000010 */
#define RISAF_REGZNESTR_DCCID2        (0x2UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000020 */
#define RISAF_REGZNESTR_DCCID3        (0x3UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000030 */
#define RISAF_REGZNESTR_DCCID4        (0x4UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000040 */
#define RISAF_REGZNESTR_DCCID5        (0x5UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000050 */
#define RISAF_REGZNESTR_DCCID6        (0x6UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000060 */
#define RISAF_REGZNESTR_DCCID7        (0x7UL << RISAF_REGZNESTR_DCCID_Pos)       /*!< 0x00000070 */

/*******************  Bits definition for RISAF_HWCFGR register *****************/
#define RISAF_HWCFGR_CFG1_Pos         (0U)
#define RISAF_HWCFGR_CFG1_Msk         (0xFFUL << RISAF_HWCFGR_CFG1_Pos)          /*!< 0x000000FF */
#define RISAF_HWCFGR_CFG1             RISAF_HWCFGR_CFG1_Msk
#define RISAF_HWCFGR_CFG2_Pos         (8U)
#define RISAF_HWCFGR_CFG2_Msk         (0xFFUL << RISAF_HWCFGR_CFG2_Pos)          /*!< 0x0000FF00 */
#define RISAF_HWCFGR_CFG2             RISAF_HWCFGR_CFG2_Msk
#define RISAF_HWCFGR_CFG3_Pos         (16U)
#define RISAF_HWCFGR_CFG3_Msk         (0xFFUL << RISAF_HWCFGR_CFG3_Pos)          /*!< 0x00FF0000 */
#define RISAF_HWCFGR_CFG3             RISAF_HWCFGR_CFG3_Msk
#define RISAF_HWCFGR_CFG4_Pos         (24U)
#define RISAF_HWCFGR_CFG4_Msk         (0xFFUL << RISAF_HWCFGR_CFG4_Pos)          /*!< 0xFF000000 */
#define RISAF_HWCFGR_CFG4             RISAF_HWCFGR_CFG4_Msk

/*******************  Bits definition for RISAF_VERR register *****************/
#define RISAF_VERR_MINREV_Pos         (0U)
#define RISAF_VERR_MINREV_Msk         (0xFUL << RISAF_VERR_MINREV_Pos)           /*!< 0x0000000F */
#define RISAF_VERR_MINREV             RISAF_VERR_MINREV_Msk

#define RISAF_VERR_MAJREV_Pos         (4U)
#define RISAF_VERR_MAJREV_Msk         (0xFUL << RISAF_VERR_MAJREV_Pos)           /*!< 0x000000F0 */
#define RISAF_VERR_MAJREV             RISAF_VERR_MAJREV_Msk

/*******************  Bits definition for RISAF_IPIDR register ****************/
#define RISAF_IPIDR_ID_Pos            (0U)
#define RISAF_IPIDR_ID_Msk            (0xFFFFFFFFUL << RISAF_IPIDR_ID_Pos)       /*!< 0xFFFFFFFF */
#define RISAF_IPIDR_ID                RISAF_IPIDR_ID_Msk

/*******************  Bits definition for RISAF_SIDR register *****************/
#define RISAF_SIDR_SID_Pos            (0U)
#define RISAF_SIDR_SID_Msk            (0xFFFFFFFFUL << RISAF_SIDR_SID_Pos)       /*!< 0xFFFFFFFF */
#define RISAF_SIDR_SID                RISAF_SIDR_SID_Msk

/*******************  Bits definition for RISAF_XCR register ******************/
#define RISAF_XCR_XLOCK_Pos           (0U)
#define RISAF_XCR_XLOCK_Msk           (0x1UL << RISAF_XCR_XLOCK_Pos)             /*!< 0x00000001 */
#define RISAF_XCR_XLOCK               RISAF_XCR_XLOCK_Msk
#define RISAF_XCR_MKLOCK_Pos          (1U)
#define RISAF_XCR_MKLOCK_Msk          (0x1UL << RISAF_XCR_MKLOCK_Pos)            /*!< 0x00000002 */
#define RISAF_XCR_MKLOCK              RISAF_XCR_MKLOCK_Msk
#define RISAF_XCR_CIPHERSEL_Pos       (4U)
#define RISAF_XCR_CIPHERSEL_Msk       (0x3UL << RISAF_XCR_CIPHERSEL_Pos)         /*!< 0x00000030 */
#define RISAF_XCR_CIPHERSEL           RISAF_XCR_CIPHERSEL_Msk

/*******************  Bits definition for RISAF_XSR register ******************/
#define RISAF_XSR_MKVALID_Pos         (0U)
#define RISAF_XSR_MKVALID_Msk         (0x1UL << RISAF_XSR_MKVALID_Pos)           /*!< 0x00000001 */
#define RISAF_XSR_MKVALID             RISAF_XSR_MKVALID_Msk

/*******************  Bits definition for RISAF_MKEYR0 register ***************/
#define RISAF_MKEYR0_MKEY_Pos         (0U)
#define RISAF_MKEYR0_MKEY_Msk         (0xFFFFFFFFUL << RISAF_MKEYR0_MKEY_Pos)    /*!< 0xFFFFFFFF */
#define RISAF_MKEYR0_MKEY             RISAF_MKEYR0_MKEY_Msk

/*******************  Bits definition for RISAF_MKEYR1 register ***************/
#define RISAF_MKEYR1_MKEY_Pos         (0U)
#define RISAF_MKEYR1_MKEY_Msk         (0xFFFFFFFFUL << RISAF_MKEYR1_MKEY_Pos)    /*!< 0xFFFFFFFF */
#define RISAF_MKEYR1_MKEY             RISAF_MKEYR1_MKEY_Msk

