zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211cxx_ca35.h
/*******************  Bits definition for IAC_ISR3 register *******************/
#define IAC_ISR3_IAF96_Pos            (0U)
#define IAC_ISR3_IAF96_Msk            (0x1UL << IAC_ISR3_IAF96_Pos)              /*!< 0x00000001 */
#define IAC_ISR3_IAF96                IAC_ISR3_IAF96_Msk
#define IAC_ISR3_IAF97_Pos            (1U)
#define IAC_ISR3_IAF97_Msk            (0x1UL << IAC_ISR3_IAF97_Pos)              /*!< 0x00000002 */
#define IAC_ISR3_IAF97                IAC_ISR3_IAF97_Msk
#define IAC_ISR3_IAF98_Pos            (2U)
#define IAC_ISR3_IAF98_Msk            (0x1UL << IAC_ISR3_IAF98_Pos)              /*!< 0x00000004 */
#define IAC_ISR3_IAF98                IAC_ISR3_IAF98_Msk
#define IAC_ISR3_IAF99_Pos            (3U)
#define IAC_ISR3_IAF99_Msk            (0x1UL << IAC_ISR3_IAF99_Pos)              /*!< 0x00000008 */
#define IAC_ISR3_IAF99                IAC_ISR3_IAF99_Msk
#define IAC_ISR3_IAF100_Pos           (4U)
#define IAC_ISR3_IAF100_Msk           (0x1UL << IAC_ISR3_IAF100_Pos)             /*!< 0x00000010 */
#define IAC_ISR3_IAF100               IAC_ISR3_IAF100_Msk
#define IAC_ISR3_IAF101_Pos           (5U)
#define IAC_ISR3_IAF101_Msk           (0x1UL << IAC_ISR3_IAF101_Pos)             /*!< 0x00000020 */
#define IAC_ISR3_IAF101               IAC_ISR3_IAF101_Msk
#define IAC_ISR3_IAF102_Pos           (6U)
#define IAC_ISR3_IAF102_Msk           (0x1UL << IAC_ISR3_IAF102_Pos)             /*!< 0x00000040 */
#define IAC_ISR3_IAF102               IAC_ISR3_IAF102_Msk
#define IAC_ISR3_IAF103_Pos           (7U)
#define IAC_ISR3_IAF103_Msk           (0x1UL << IAC_ISR3_IAF103_Pos)             /*!< 0x00000080 */
#define IAC_ISR3_IAF103               IAC_ISR3_IAF103_Msk
#define IAC_ISR3_IAF104_Pos           (8U)
#define IAC_ISR3_IAF104_Msk           (0x1UL << IAC_ISR3_IAF104_Pos)             /*!< 0x00000100 */
#define IAC_ISR3_IAF104               IAC_ISR3_IAF104_Msk
#define IAC_ISR3_IAF105_Pos           (9U)
#define IAC_ISR3_IAF105_Msk           (0x1UL << IAC_ISR3_IAF105_Pos)             /*!< 0x00000200 */
#define IAC_ISR3_IAF105               IAC_ISR3_IAF105_Msk
#define IAC_ISR3_IAF106_Pos           (10U)
#define IAC_ISR3_IAF106_Msk           (0x1UL << IAC_ISR3_IAF106_Pos)             /*!< 0x00000400 */
#define IAC_ISR3_IAF106               IAC_ISR3_IAF106_Msk
#define IAC_ISR3_IAF107_Pos           (11U)
#define IAC_ISR3_IAF107_Msk           (0x1UL << IAC_ISR3_IAF107_Pos)             /*!< 0x00000800 */
#define IAC_ISR3_IAF107               IAC_ISR3_IAF107_Msk
#define IAC_ISR3_IAF108_Pos           (12U)
#define IAC_ISR3_IAF108_Msk           (0x1UL << IAC_ISR3_IAF108_Pos)             /*!< 0x00001000 */
#define IAC_ISR3_IAF108               IAC_ISR3_IAF108_Msk
#define IAC_ISR3_IAF109_Pos           (13U)
#define IAC_ISR3_IAF109_Msk           (0x1UL << IAC_ISR3_IAF109_Pos)             /*!< 0x00002000 */
#define IAC_ISR3_IAF109               IAC_ISR3_IAF109_Msk
#define IAC_ISR3_IAF110_Pos           (14U)
#define IAC_ISR3_IAF110_Msk           (0x1UL << IAC_ISR3_IAF110_Pos)             /*!< 0x00004000 */
#define IAC_ISR3_IAF110               IAC_ISR3_IAF110_Msk
#define IAC_ISR3_IAF111_Pos           (15U)
#define IAC_ISR3_IAF111_Msk           (0x1UL << IAC_ISR3_IAF111_Pos)             /*!< 0x00008000 */
#define IAC_ISR3_IAF111               IAC_ISR3_IAF111_Msk
#define IAC_ISR3_IAF112_Pos           (16U)
#define IAC_ISR3_IAF112_Msk           (0x1UL << IAC_ISR3_IAF112_Pos)             /*!< 0x00010000 */
#define IAC_ISR3_IAF112               IAC_ISR3_IAF112_Msk
#define IAC_ISR3_IAF113_Pos           (17U)
#define IAC_ISR3_IAF113_Msk           (0x1UL << IAC_ISR3_IAF113_Pos)             /*!< 0x00020000 */
#define IAC_ISR3_IAF113               IAC_ISR3_IAF113_Msk
#define IAC_ISR3_IAF114_Pos           (18U)
#define IAC_ISR3_IAF114_Msk           (0x1UL << IAC_ISR3_IAF114_Pos)             /*!< 0x00040000 */
#define IAC_ISR3_IAF114               IAC_ISR3_IAF114_Msk
#define IAC_ISR3_IAF115_Pos           (19U)
#define IAC_ISR3_IAF115_Msk           (0x1UL << IAC_ISR3_IAF115_Pos)             /*!< 0x00080000 */
#define IAC_ISR3_IAF115               IAC_ISR3_IAF115_Msk
#define IAC_ISR3_IAF116_Pos           (20U)
#define IAC_ISR3_IAF116_Msk           (0x1UL << IAC_ISR3_IAF116_Pos)             /*!< 0x00100000 */
#define IAC_ISR3_IAF116               IAC_ISR3_IAF116_Msk
#define IAC_ISR3_IAF117_Pos           (21U)
#define IAC_ISR3_IAF117_Msk           (0x1UL << IAC_ISR3_IAF117_Pos)             /*!< 0x00200000 */
#define IAC_ISR3_IAF117               IAC_ISR3_IAF117_Msk
#define IAC_ISR3_IAF118_Pos           (22U)
#define IAC_ISR3_IAF118_Msk           (0x1UL << IAC_ISR3_IAF118_Pos)             /*!< 0x00400000 */
#define IAC_ISR3_IAF118               IAC_ISR3_IAF118_Msk
#define IAC_ISR3_IAF119_Pos           (23U)
#define IAC_ISR3_IAF119_Msk           (0x1UL << IAC_ISR3_IAF119_Pos)             /*!< 0x00800000 */
#define IAC_ISR3_IAF119               IAC_ISR3_IAF119_Msk
#define IAC_ISR3_IAF120_Pos           (24U)
#define IAC_ISR3_IAF120_Msk           (0x1UL << IAC_ISR3_IAF120_Pos)             /*!< 0x01000000 */
#define IAC_ISR3_IAF120               IAC_ISR3_IAF120_Msk
#define IAC_ISR3_IAF121_Pos           (25U)
#define IAC_ISR3_IAF121_Msk           (0x1UL << IAC_ISR3_IAF121_Pos)             /*!< 0x02000000 */
#define IAC_ISR3_IAF121               IAC_ISR3_IAF121_Msk
#define IAC_ISR3_IAF122_Pos           (26U)
#define IAC_ISR3_IAF122_Msk           (0x1UL << IAC_ISR3_IAF122_Pos)             /*!< 0x04000000 */
#define IAC_ISR3_IAF122               IAC_ISR3_IAF122_Msk
#define IAC_ISR3_IAF123_Pos           (27U)
#define IAC_ISR3_IAF123_Msk           (0x1UL << IAC_ISR3_IAF123_Pos)             /*!< 0x08000000 */
#define IAC_ISR3_IAF123               IAC_ISR3_IAF123_Msk
#define IAC_ISR3_IAF124_Pos           (28U)
#define IAC_ISR3_IAF124_Msk           (0x1UL << IAC_ISR3_IAF124_Pos)             /*!< 0x10000000 */
#define IAC_ISR3_IAF124               IAC_ISR3_IAF124_Msk
#define IAC_ISR3_IAF125_Pos           (29U)
#define IAC_ISR3_IAF125_Msk           (0x1UL << IAC_ISR3_IAF125_Pos)             /*!< 0x20000000 */
#define IAC_ISR3_IAF125               IAC_ISR3_IAF125_Msk
#define IAC_ISR3_IAF126_Pos           (30U)
#define IAC_ISR3_IAF126_Msk           (0x1UL << IAC_ISR3_IAF126_Pos)             /*!< 0x40000000 */
#define IAC_ISR3_IAF126               IAC_ISR3_IAF126_Msk
#define IAC_ISR3_IAF127_Pos           (31U)
#define IAC_ISR3_IAF127_Msk           (0x1UL << IAC_ISR3_IAF127_Pos)             /*!< 0x80000000 */
#define IAC_ISR3_IAF127               IAC_ISR3_IAF127_Msk

/*******************  Bits definition for IAC_ISR4 register *******************/
#define IAC_ISR4_IAF128_Pos           (0U)
#define IAC_ISR4_IAF128_Msk           (0x1UL << IAC_ISR4_IAF128_Pos)             /*!< 0x00000001 */
#define IAC_ISR4_IAF128               IAC_ISR4_IAF128_Msk
#define IAC_ISR4_IAF129_Pos           (1U)
#define IAC_ISR4_IAF129_Msk           (0x1UL << IAC_ISR4_IAF129_Pos)             /*!< 0x00000002 */
#define IAC_ISR4_IAF129               IAC_ISR4_IAF129_Msk
#define IAC_ISR4_IAF130_Pos           (2U)
#define IAC_ISR4_IAF130_Msk           (0x1UL << IAC_ISR4_IAF130_Pos)             /*!< 0x00000004 */
#define IAC_ISR4_IAF130               IAC_ISR4_IAF130_Msk
#define IAC_ISR4_IAF131_Pos           (3U)
#define IAC_ISR4_IAF131_Msk           (0x1UL << IAC_ISR4_IAF131_Pos)             /*!< 0x00000008 */
#define IAC_ISR4_IAF131               IAC_ISR4_IAF131_Msk
#define IAC_ISR4_IAF132_Pos           (4U)
#define IAC_ISR4_IAF132_Msk           (0x1UL << IAC_ISR4_IAF132_Pos)             /*!< 0x00000010 */
#define IAC_ISR4_IAF132               IAC_ISR4_IAF132_Msk
#define IAC_ISR4_IAF133_Pos           (5U)
#define IAC_ISR4_IAF133_Msk           (0x1UL << IAC_ISR4_IAF133_Pos)             /*!< 0x00000020 */
#define IAC_ISR4_IAF133               IAC_ISR4_IAF133_Msk
#define IAC_ISR4_IAF134_Pos           (6U)
#define IAC_ISR4_IAF134_Msk           (0x1UL << IAC_ISR4_IAF134_Pos)             /*!< 0x00000040 */
#define IAC_ISR4_IAF134               IAC_ISR4_IAF134_Msk
#define IAC_ISR4_IAF135_Pos           (7U)
#define IAC_ISR4_IAF135_Msk           (0x1UL << IAC_ISR4_IAF135_Pos)             /*!< 0x00000080 */
#define IAC_ISR4_IAF135               IAC_ISR4_IAF135_Msk
#define IAC_ISR4_IAF136_Pos           (8U)
#define IAC_ISR4_IAF136_Msk           (0x1UL << IAC_ISR4_IAF136_Pos)             /*!< 0x00000100 */
#define IAC_ISR4_IAF136               IAC_ISR4_IAF136_Msk
#define IAC_ISR4_IAF137_Pos           (9U)
#define IAC_ISR4_IAF137_Msk           (0x1UL << IAC_ISR4_IAF137_Pos)             /*!< 0x00000200 */
#define IAC_ISR4_IAF137               IAC_ISR4_IAF137_Msk
#define IAC_ISR4_IAF138_Pos           (10U)
#define IAC_ISR4_IAF138_Msk           (0x1UL << IAC_ISR4_IAF138_Pos)             /*!< 0x00000400 */
#define IAC_ISR4_IAF138               IAC_ISR4_IAF138_Msk
#define IAC_ISR4_IAF139_Pos           (11U)
#define IAC_ISR4_IAF139_Msk           (0x1UL << IAC_ISR4_IAF139_Pos)             /*!< 0x00000800 */
#define IAC_ISR4_IAF139               IAC_ISR4_IAF139_Msk
#define IAC_ISR4_IAF140_Pos           (12U)
#define IAC_ISR4_IAF140_Msk           (0x1UL << IAC_ISR4_IAF140_Pos)             /*!< 0x00001000 */
#define IAC_ISR4_IAF140               IAC_ISR4_IAF140_Msk
#define IAC_ISR4_IAF141_Pos           (13U)
#define IAC_ISR4_IAF141_Msk           (0x1UL << IAC_ISR4_IAF141_Pos)             /*!< 0x00002000 */
#define IAC_ISR4_IAF141               IAC_ISR4_IAF141_Msk
#define IAC_ISR4_IAF142_Pos           (14U)
#define IAC_ISR4_IAF142_Msk           (0x1UL << IAC_ISR4_IAF142_Pos)             /*!< 0x00004000 */
#define IAC_ISR4_IAF142               IAC_ISR4_IAF142_Msk
#define IAC_ISR4_IAF143_Pos           (15U)
#define IAC_ISR4_IAF143_Msk           (0x1UL << IAC_ISR4_IAF143_Pos)             /*!< 0x00008000 */
#define IAC_ISR4_IAF143               IAC_ISR4_IAF143_Msk
#define IAC_ISR4_IAF144_Pos           (16U)
#define IAC_ISR4_IAF144_Msk           (0x1UL << IAC_ISR4_IAF144_Pos)             /*!< 0x00010000 */
#define IAC_ISR4_IAF144               IAC_ISR4_IAF144_Msk
#define IAC_ISR4_IAF145_Pos           (17U)
#define IAC_ISR4_IAF145_Msk           (0x1UL << IAC_ISR4_IAF145_Pos)             /*!< 0x00020000 */
#define IAC_ISR4_IAF145               IAC_ISR4_IAF145_Msk
#define IAC_ISR4_IAF146_Pos           (18U)
#define IAC_ISR4_IAF146_Msk           (0x1UL << IAC_ISR4_IAF146_Pos)             /*!< 0x00040000 */
#define IAC_ISR4_IAF146               IAC_ISR4_IAF146_Msk
#define IAC_ISR4_IAF147_Pos           (19U)
#define IAC_ISR4_IAF147_Msk           (0x1UL << IAC_ISR4_IAF147_Pos)             /*!< 0x00080000 */
#define IAC_ISR4_IAF147               IAC_ISR4_IAF147_Msk
#define IAC_ISR4_IAF148_Pos           (20U)
#define IAC_ISR4_IAF148_Msk           (0x1UL << IAC_ISR4_IAF148_Pos)             /*!< 0x00100000 */
#define IAC_ISR4_IAF148               IAC_ISR4_IAF148_Msk
#define IAC_ISR4_IAF149_Pos           (21U)
#define IAC_ISR4_IAF149_Msk           (0x1UL << IAC_ISR4_IAF149_Pos)             /*!< 0x00200000 */
#define IAC_ISR4_IAF149               IAC_ISR4_IAF149_Msk
#define IAC_ISR4_IAF150_Pos           (22U)
#define IAC_ISR4_IAF150_Msk           (0x1UL << IAC_ISR4_IAF150_Pos)             /*!< 0x00400000 */
#define IAC_ISR4_IAF150               IAC_ISR4_IAF150_Msk
#define IAC_ISR4_IAF151_Pos           (23U)
#define IAC_ISR4_IAF151_Msk           (0x1UL << IAC_ISR4_IAF151_Pos)             /*!< 0x00800000 */
#define IAC_ISR4_IAF151               IAC_ISR4_IAF151_Msk
#define IAC_ISR4_IAF152_Pos           (24U)
#define IAC_ISR4_IAF152_Msk           (0x1UL << IAC_ISR4_IAF152_Pos)             /*!< 0x01000000 */
#define IAC_ISR4_IAF152               IAC_ISR4_IAF152_Msk
#define IAC_ISR4_IAF153_Pos           (25U)
#define IAC_ISR4_IAF153_Msk           (0x1UL << IAC_ISR4_IAF153_Pos)             /*!< 0x02000000 */
#define IAC_ISR4_IAF153               IAC_ISR4_IAF153_Msk
#define IAC_ISR4_IAF154_Pos           (26U)
#define IAC_ISR4_IAF154_Msk           (0x1UL << IAC_ISR4_IAF154_Pos)             /*!< 0x04000000 */
#define IAC_ISR4_IAF154               IAC_ISR4_IAF154_Msk
#define IAC_ISR4_IAF155_Pos           (27U)
#define IAC_ISR4_IAF155_Msk           (0x1UL << IAC_ISR4_IAF155_Pos)             /*!< 0x08000000 */
#define IAC_ISR4_IAF155               IAC_ISR4_IAF155_Msk
#define IAC_ISR4_IAF156_Pos           (28U)
#define IAC_ISR4_IAF156_Msk           (0x1UL << IAC_ISR4_IAF156_Pos)             /*!< 0x10000000 */
#define IAC_ISR4_IAF156               IAC_ISR4_IAF156_Msk
#define IAC_ISR4_IAF157_Pos           (29U)
#define IAC_ISR4_IAF157_Msk           (0x1UL << IAC_ISR4_IAF157_Pos)             /*!< 0x20000000 */
#define IAC_ISR4_IAF157               IAC_ISR4_IAF157_Msk
#define IAC_ISR4_IAF158_Pos           (30U)
#define IAC_ISR4_IAF158_Msk           (0x1UL << IAC_ISR4_IAF158_Pos)             /*!< 0x40000000 */
#define IAC_ISR4_IAF158               IAC_ISR4_IAF158_Msk
#define IAC_ISR4_IAF159_Pos           (31U)
#define IAC_ISR4_IAF159_Msk           (0x1UL << IAC_ISR4_IAF159_Pos)             /*!< 0x80000000 */
#define IAC_ISR4_IAF159               IAC_ISR4_IAF159_Msk

/*******************  Bits definition for IAC_ISR5 register *******************/
#define IAC_ISR5_IAF160_Pos           (0U)
#define IAC_ISR5_IAF160_Msk           (0x1UL << IAC_ISR5_IAF160_Pos)             /*!< 0x00000001 */
#define IAC_ISR5_IAF160               IAC_ISR5_IAF160_Msk
#define IAC_ISR5_IAF161_Pos           (1U)
#define IAC_ISR5_IAF161_Msk           (0x1UL << IAC_ISR5_IAF161_Pos)             /*!< 0x00000002 */
#define IAC_ISR5_IAF161               IAC_ISR5_IAF161_Msk
#define IAC_ISR5_IAF162_Pos           (2U)
#define IAC_ISR5_IAF162_Msk           (0x1UL << IAC_ISR5_IAF162_Pos)             /*!< 0x00000004 */
#define IAC_ISR5_IAF162               IAC_ISR5_IAF162_Msk
#define IAC_ISR5_IAF163_Pos           (3U)
#define IAC_ISR5_IAF163_Msk           (0x1UL << IAC_ISR5_IAF163_Pos)             /*!< 0x00000008 */
#define IAC_ISR5_IAF163               IAC_ISR5_IAF163_Msk
#define IAC_ISR5_IAF164_Pos           (4U)
#define IAC_ISR5_IAF164_Msk           (0x1UL << IAC_ISR5_IAF164_Pos)             /*!< 0x00000010 */
#define IAC_ISR5_IAF164               IAC_ISR5_IAF164_Msk
#define IAC_ISR5_IAF165_Pos           (5U)
#define IAC_ISR5_IAF165_Msk           (0x1UL << IAC_ISR5_IAF165_Pos)             /*!< 0x00000020 */
#define IAC_ISR5_IAF165               IAC_ISR5_IAF165_Msk
#define IAC_ISR5_IAF166_Pos           (6U)
#define IAC_ISR5_IAF166_Msk           (0x1UL << IAC_ISR5_IAF166_Pos)             /*!< 0x00000040 */
#define IAC_ISR5_IAF166               IAC_ISR5_IAF166_Msk
#define IAC_ISR5_IAF167_Pos           (7U)
#define IAC_ISR5_IAF167_Msk           (0x1UL << IAC_ISR5_IAF167_Pos)             /*!< 0x00000080 */
#define IAC_ISR5_IAF167               IAC_ISR5_IAF167_Msk
#define IAC_ISR5_IAF168_Pos           (8U)
#define IAC_ISR5_IAF168_Msk           (0x1UL << IAC_ISR5_IAF168_Pos)             /*!< 0x00000100 */
#define IAC_ISR5_IAF168               IAC_ISR5_IAF168_Msk
#define IAC_ISR5_IAF169_Pos           (9U)
#define IAC_ISR5_IAF169_Msk           (0x1UL << IAC_ISR5_IAF169_Pos)             /*!< 0x00000200 */
#define IAC_ISR5_IAF169               IAC_ISR5_IAF169_Msk
#define IAC_ISR5_IAF170_Pos           (10U)
#define IAC_ISR5_IAF170_Msk           (0x1UL << IAC_ISR5_IAF170_Pos)             /*!< 0x00000400 */
#define IAC_ISR5_IAF170               IAC_ISR5_IAF170_Msk
#define IAC_ISR5_IAF171_Pos           (11U)
#define IAC_ISR5_IAF171_Msk           (0x1UL << IAC_ISR5_IAF171_Pos)             /*!< 0x00000800 */
#define IAC_ISR5_IAF171               IAC_ISR5_IAF171_Msk
#define IAC_ISR5_IAF172_Pos           (12U)
#define IAC_ISR5_IAF172_Msk           (0x1UL << IAC_ISR5_IAF172_Pos)             /*!< 0x00001000 */
#define IAC_ISR5_IAF172               IAC_ISR5_IAF172_Msk
#define IAC_ISR5_IAF173_Pos           (13U)
#define IAC_ISR5_IAF173_Msk           (0x1UL << IAC_ISR5_IAF173_Pos)             /*!< 0x00002000 */
#define IAC_ISR5_IAF173               IAC_ISR5_IAF173_Msk
#define IAC_ISR5_IAF174_Pos           (14U)
#define IAC_ISR5_IAF174_Msk           (0x1UL << IAC_ISR5_IAF174_Pos)             /*!< 0x00004000 */
#define IAC_ISR5_IAF174               IAC_ISR5_IAF174_Msk
#define IAC_ISR5_IAF175_Pos           (15U)
#define IAC_ISR5_IAF175_Msk           (0x1UL << IAC_ISR5_IAF175_Pos)             /*!< 0x00008000 */
#define IAC_ISR5_IAF175               IAC_ISR5_IAF175_Msk
#define IAC_ISR5_IAF176_Pos           (16U)
#define IAC_ISR5_IAF176_Msk           (0x1UL << IAC_ISR5_IAF176_Pos)             /*!< 0x00010000 */
#define IAC_ISR5_IAF176               IAC_ISR5_IAF176_Msk
#define IAC_ISR5_IAF177_Pos           (17U)
#define IAC_ISR5_IAF177_Msk           (0x1UL << IAC_ISR5_IAF177_Pos)             /*!< 0x00020000 */
#define IAC_ISR5_IAF177               IAC_ISR5_IAF177_Msk
#define IAC_ISR5_IAF178_Pos           (18U)
#define IAC_ISR5_IAF178_Msk           (0x1UL << IAC_ISR5_IAF178_Pos)             /*!< 0x00040000 */
#define IAC_ISR5_IAF178               IAC_ISR5_IAF178_Msk
#define IAC_ISR5_IAF179_Pos           (19U)
#define IAC_ISR5_IAF179_Msk           (0x1UL << IAC_ISR5_IAF179_Pos)             /*!< 0x00080000 */
#define IAC_ISR5_IAF179               IAC_ISR5_IAF179_Msk
#define IAC_ISR5_IAF180_Pos           (20U)
#define IAC_ISR5_IAF180_Msk           (0x1UL << IAC_ISR5_IAF180_Pos)             /*!< 0x00100000 */
#define IAC_ISR5_IAF180               IAC_ISR5_IAF180_Msk
#define IAC_ISR5_IAF181_Pos           (21U)
#define IAC_ISR5_IAF181_Msk           (0x1UL << IAC_ISR5_IAF181_Pos)             /*!< 0x00200000 */
#define IAC_ISR5_IAF181               IAC_ISR5_IAF181_Msk
#define IAC_ISR5_IAF182_Pos           (22U)
#define IAC_ISR5_IAF182_Msk           (0x1UL << IAC_ISR5_IAF182_Pos)             /*!< 0x00400000 */
#define IAC_ISR5_IAF182               IAC_ISR5_IAF182_Msk
#define IAC_ISR5_IAF183_Pos           (23U)
#define IAC_ISR5_IAF183_Msk           (0x1UL << IAC_ISR5_IAF183_Pos)             /*!< 0x00800000 */
#define IAC_ISR5_IAF183               IAC_ISR5_IAF183_Msk
#define IAC_ISR5_IAF184_Pos           (24U)
#define IAC_ISR5_IAF184_Msk           (0x1UL << IAC_ISR5_IAF184_Pos)             /*!< 0x01000000 */
#define IAC_ISR5_IAF184               IAC_ISR5_IAF184_Msk
#define IAC_ISR5_IAF185_Pos           (25U)
#define IAC_ISR5_IAF185_Msk           (0x1UL << IAC_ISR5_IAF185_Pos)             /*!< 0x02000000 */
#define IAC_ISR5_IAF185               IAC_ISR5_IAF185_Msk
#define IAC_ISR5_IAF186_Pos           (26U)
#define IAC_ISR5_IAF186_Msk           (0x1UL << IAC_ISR5_IAF186_Pos)             /*!< 0x04000000 */
#define IAC_ISR5_IAF186               IAC_ISR5_IAF186_Msk
#define IAC_ISR5_IAF187_Pos           (27U)
#define IAC_ISR5_IAF187_Msk           (0x1UL << IAC_ISR5_IAF187_Pos)             /*!< 0x08000000 */
#define IAC_ISR5_IAF187               IAC_ISR5_IAF187_Msk
#define IAC_ISR5_IAF188_Pos           (28U)
#define IAC_ISR5_IAF188_Msk           (0x1UL << IAC_ISR5_IAF188_Pos)             /*!< 0x10000000 */
#define IAC_ISR5_IAF188               IAC_ISR5_IAF188_Msk
#define IAC_ISR5_IAF189_Pos           (29U)
#define IAC_ISR5_IAF189_Msk           (0x1UL << IAC_ISR5_IAF189_Pos)             /*!< 0x20000000 */
#define IAC_ISR5_IAF189               IAC_ISR5_IAF189_Msk
#define IAC_ISR5_IAF190_Pos           (30U)
#define IAC_ISR5_IAF190_Msk           (0x1UL << IAC_ISR5_IAF190_Pos)             /*!< 0x40000000 */
#define IAC_ISR5_IAF190               IAC_ISR5_IAF190_Msk
#define IAC_ISR5_IAF191_Pos           (31U)
#define IAC_ISR5_IAF191_Msk           (0x1UL << IAC_ISR5_IAF191_Pos)             /*!< 0x80000000 */
#define IAC_ISR5_IAF191               IAC_ISR5_IAF191_Msk

