zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211cxx_ca35.h
/**************  Bit definition for SYSCFG_ICNETHBWLCR register  **************/
#define SYSCFG_ICNETHBWLCR_BWLEN_Pos                                  (1U)
#define SYSCFG_ICNETHBWLCR_BWLEN_Msk                                  (0x1UL << SYSCFG_ICNETHBWLCR_BWLEN_Pos)                                    /*!< 0x00000002 */
#define SYSCFG_ICNETHBWLCR_BWLEN                                      SYSCFG_ICNETHBWLCR_BWLEN_Msk                                              /*!< Bandwidth limiter enable */
#define SYSCFG_ICNETHBWLCR_MAXABW_Pos                                 (8U)
#define SYSCFG_ICNETHBWLCR_MAXABW_Msk                                 (0xFFUL << SYSCFG_ICNETHBWLCR_MAXABW_Pos)                                  /*!< 0x0000FF00 */
#define SYSCFG_ICNETHBWLCR_MAXABW                                     SYSCFG_ICNETHBWLCR_MAXABW_Msk                                             /*!< Maximum allowed Bandwidth */

/*************  Bit definition for SYSCFG_ICNCPU1BWLCR register  **************/
#define SYSCFG_ICNCPU1BWLCR_BWLEN_Pos                                 (1U)
#define SYSCFG_ICNCPU1BWLCR_BWLEN_Msk                                 (0x1UL << SYSCFG_ICNCPU1BWLCR_BWLEN_Pos)                                   /*!< 0x00000002 */
#define SYSCFG_ICNCPU1BWLCR_BWLEN                                     SYSCFG_ICNCPU1BWLCR_BWLEN_Msk                                             /*!< Bandwidth limiter enable */
#define SYSCFG_ICNCPU1BWLCR_MAXABW_Pos                                (8U)
#define SYSCFG_ICNCPU1BWLCR_MAXABW_Msk                                (0xFFUL << SYSCFG_ICNCPU1BWLCR_MAXABW_Pos)                                 /*!< 0x0000FF00 */
#define SYSCFG_ICNCPU1BWLCR_MAXABW                                    SYSCFG_ICNCPU1BWLCR_MAXABW_Msk                                            /*!< Maximum allowed Bandwidth */

/*************  Bit definition for SYSCFG_ICNLTDCBWLCR register  **************/
#define SYSCFG_ICNLTDCBWLCR_BWLEN_Pos                                 (1U)
#define SYSCFG_ICNLTDCBWLCR_BWLEN_Msk                                 (0x1UL << SYSCFG_ICNLTDCBWLCR_BWLEN_Pos)                                   /*!< 0x00000002 */
#define SYSCFG_ICNLTDCBWLCR_BWLEN                                     SYSCFG_ICNLTDCBWLCR_BWLEN_Msk                                             /*!< Bandwidth limiter enable */
#define SYSCFG_ICNLTDCBWLCR_MAXABW_Pos                                (8U)
#define SYSCFG_ICNLTDCBWLCR_MAXABW_Msk                                (0xFFUL << SYSCFG_ICNLTDCBWLCR_MAXABW_Pos)                                 /*!< 0x0000FF00 */
#define SYSCFG_ICNLTDCBWLCR_MAXABW                                    SYSCFG_ICNLTDCBWLCR_MAXABW_Msk                                            /*!< Maximum allowed Bandwidth */

/************  Bit definition for SYSCFG_ICNDCMIPPBWLCR register  *************/
#define SYSCFG_ICNDCMIPPBWLCR_BWLEN_Pos                               (1U)
#define SYSCFG_ICNDCMIPPBWLCR_BWLEN_Msk                               (0x1UL << SYSCFG_ICNDCMIPPBWLCR_BWLEN_Pos)                                 /*!< 0x00000002 */
#define SYSCFG_ICNDCMIPPBWLCR_BWLEN                                   SYSCFG_ICNDCMIPPBWLCR_BWLEN_Msk                                           /*!< Bandwidth limiter enable */
#define SYSCFG_ICNDCMIPPBWLCR_MAXABW_Pos                              (8U)
#define SYSCFG_ICNDCMIPPBWLCR_MAXABW_Msk                              (0xFFUL << SYSCFG_ICNDCMIPPBWLCR_MAXABW_Pos)                               /*!< 0x0000FF00 */
#define SYSCFG_ICNDCMIPPBWLCR_MAXABW                                  SYSCFG_ICNDCMIPPBWLCR_MAXABW_Msk                                          /*!< Maximum allowed Bandwidth */

/**************  Bit definition for SYSCFG_ICNVDEBWLCR register  **************/
#define SYSCFG_ICNVDEBWLCR_BWLEN_Pos                                  (1U)
#define SYSCFG_ICNVDEBWLCR_BWLEN_Msk                                  (0x1UL << SYSCFG_ICNVDEBWLCR_BWLEN_Pos)                                    /*!< 0x00000002 */
#define SYSCFG_ICNVDEBWLCR_BWLEN                                      SYSCFG_ICNVDEBWLCR_BWLEN_Msk                                              /*!< Bandwidth limiter enable */
#define SYSCFG_ICNVDEBWLCR_MAXABW_Pos                                 (8U)
#define SYSCFG_ICNVDEBWLCR_MAXABW_Msk                                 (0xFFUL << SYSCFG_ICNVDEBWLCR_MAXABW_Pos)                                  /*!< 0x0000FF00 */
#define SYSCFG_ICNVDEBWLCR_MAXABW                                     SYSCFG_ICNVDEBWLCR_MAXABW_Msk                                             /*!< Maximum allowed Bandwidth */

/***************  Bit definition for SYSCFG_HPDMAARCR register  ***************/
#define SYSCFG_HPDMAARCR_HPDMA1AREN_Pos                               (0U)
#define SYSCFG_HPDMAARCR_HPDMA1AREN_Msk                               (0x1UL << SYSCFG_HPDMAARCR_HPDMA1AREN_Pos)                                 /*!< 0x00000001 */
#define SYSCFG_HPDMAARCR_HPDMA1AREN                                   SYSCFG_HPDMAARCR_HPDMA1AREN_Msk                                           /*!< Address remapping enable */
#define SYSCFG_HPDMAARCR_HPDMA2AREN_Pos                               (1U)
#define SYSCFG_HPDMAARCR_HPDMA2AREN_Msk                               (0x1UL << SYSCFG_HPDMAARCR_HPDMA2AREN_Pos)                                 /*!< 0x00000002 */
#define SYSCFG_HPDMAARCR_HPDMA2AREN                                   SYSCFG_HPDMAARCR_HPDMA2AREN_Msk                                           /*!< Address remapping enable */
#define SYSCFG_HPDMAARCR_HPDMA3AREN_Pos                               (2U)
#define SYSCFG_HPDMAARCR_HPDMA3AREN_Msk                               (0x1UL << SYSCFG_HPDMAARCR_HPDMA3AREN_Pos)                                 /*!< 0x00000004 */
#define SYSCFG_HPDMAARCR_HPDMA3AREN                                   SYSCFG_HPDMAARCR_HPDMA3AREN_Msk                                           /*!< Address remapping enable */

/**************  Bit definition for SYSCFG_USB2PHY1CR register  ***************/
#define SYSCFG_USB2PHY1CR_RETENABLEN1_Pos                             (0U)
#define SYSCFG_USB2PHY1CR_RETENABLEN1_Msk                             (0x1UL << SYSCFG_USB2PHY1CR_RETENABLEN1_Pos)                               /*!< 0x00000001 */
#define SYSCFG_USB2PHY1CR_RETENABLEN1                                 SYSCFG_USB2PHY1CR_RETENABLEN1_Msk                                         /*!< Retention mode enable (active low) */
#define SYSCFG_USB2PHY1CR_AUTORSMENB1_Pos                             (1U)
#define SYSCFG_USB2PHY1CR_AUTORSMENB1_Msk                             (0x1UL << SYSCFG_USB2PHY1CR_AUTORSMENB1_Pos)                               /*!< 0x00000002 */
#define SYSCFG_USB2PHY1CR_AUTORSMENB1                                 SYSCFG_USB2PHY1CR_AUTORSMENB1_Msk                                         /*!< Auto-resume mode enable */
#define SYSCFG_USB2PHY1CR_USB2PHY1CMN_Pos                             (2U)
#define SYSCFG_USB2PHY1CR_USB2PHY1CMN_Msk                             (0x1UL << SYSCFG_USB2PHY1CR_USB2PHY1CMN_Pos)                               /*!< 0x00000004 */
#define SYSCFG_USB2PHY1CR_USB2PHY1CMN                                 SYSCFG_USB2PHY1CR_USB2PHY1CMN_Msk                                         /*!< Controls power down of analog blocks during Suspend and Sleep */
#define SYSCFG_USB2PHY1CR_USB2PHY1SEL_Pos                             (4U)
#define SYSCFG_USB2PHY1CR_USB2PHY1SEL_Msk                             (0x7UL << SYSCFG_USB2PHY1CR_USB2PHY1SEL_Pos)                               /*!< 0x00000070 */
#define SYSCFG_USB2PHY1CR_USB2PHY1SEL                                 SYSCFG_USB2PHY1CR_USB2PHY1SEL_Msk                                         /*!< PHY reference clock speed setting */

/*************  Bit definition for SYSCFG_USB2PHY1BCCR register  **************/
#define SYSCFG_USB2PHY1BCCR_H_CDPEN_Pos                               (0U)
#define SYSCFG_USB2PHY1BCCR_H_CDPEN_Msk                               (0x1UL << SYSCFG_USB2PHY1BCCR_H_CDPEN_Pos)                                 /*!< 0x00000001 */
#define SYSCFG_USB2PHY1BCCR_H_CDPEN                                   SYSCFG_USB2PHY1BCCR_H_CDPEN_Msk                                           /*!< CDP behavior for Host port enable */
#define SYSCFG_USB2PHY1BCCR_H_CDPDETEN_Pos                            (1U)
#define SYSCFG_USB2PHY1BCCR_H_CDPDETEN_Msk                            (0x1UL << SYSCFG_USB2PHY1BCCR_H_CDPDETEN_Pos)                              /*!< 0x00000002 */
#define SYSCFG_USB2PHY1BCCR_H_CDPDETEN                                SYSCFG_USB2PHY1BCCR_H_CDPDETEN_Msk                                        /*!< Voltage detector on DP for CDP port enable */
#define SYSCFG_USB2PHY1BCCR_H_VDMSRCEN_Pos                            (2U)
#define SYSCFG_USB2PHY1BCCR_H_VDMSRCEN_Msk                            (0x1UL << SYSCFG_USB2PHY1BCCR_H_VDMSRCEN_Pos)                              /*!< 0x00000004 */
#define SYSCFG_USB2PHY1BCCR_H_VDMSRCEN                                SYSCFG_USB2PHY1BCCR_H_VDMSRCEN_Msk                                        /*!< Voltage source on DM for CDP port enable */
#define SYSCFG_USB2PHY1BCCR_H_FORCEBCMODE_Pos                         (3U)
#define SYSCFG_USB2PHY1BCCR_H_FORCEBCMODE_Msk                         (0x1UL << SYSCFG_USB2PHY1BCCR_H_FORCEBCMODE_Pos)                           /*!< 0x00000008 */
#define SYSCFG_USB2PHY1BCCR_H_FORCEBCMODE                             SYSCFG_USB2PHY1BCCR_H_FORCEBCMODE_Msk                                     /*!< Forces USB2PHY1 in non-driving suspend mode */

/*************  Bit definition for SYSCFG_USB2PHY1BCSR register  **************/
#define SYSCFG_USB2PHY1BCSR_CHGDET_Pos                                (0U)
#define SYSCFG_USB2PHY1BCSR_CHGDET_Msk                                (0x1UL << SYSCFG_USB2PHY1BCSR_CHGDET_Pos)                                  /*!< 0x00000001 */
#define SYSCFG_USB2PHY1BCSR_CHGDET                                    SYSCFG_USB2PHY1BCSR_CHGDET_Msk                                            /*!< Comparison of voltage on DP with VDAT_REF threshold as defined in BC v1 */
#define SYSCFG_USB2PHY1BCSR_FSVPLUS_Pos                               (1U)
#define SYSCFG_USB2PHY1BCSR_FSVPLUS_Msk                               (0x1UL << SYSCFG_USB2PHY1BCSR_FSVPLUS_Pos)                                 /*!< 0x00000002 */
#define SYSCFG_USB2PHY1BCSR_FSVPLUS                                   SYSCFG_USB2PHY1BCSR_FSVPLUS_Msk                                           /*!< Voltage level on DP (also output of the comparison with VLGC threshold, as defined in BC v1 */
#define SYSCFG_USB2PHY1BCSR_FSVMINUS_Pos                              (2U)
#define SYSCFG_USB2PHY1BCSR_FSVMINUS_Msk                              (0x1UL << SYSCFG_USB2PHY1BCSR_FSVMINUS_Pos)                                /*!< 0x00000004 */
#define SYSCFG_USB2PHY1BCSR_FSVMINUS                                  SYSCFG_USB2PHY1BCSR_FSVMINUS_Msk                                          /*!< Voltage level on DM (also output of the comparison with VLGC threshold, as defined in BC v1 */

/************  Bit definition for SYSCFG_USB2PHY1TRIM1CR register  ************/
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLITUNE_Pos                   (0U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLITUNE_Msk                   (0x3UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLITUNE_Pos)                     /*!< 0x00000003 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLITUNE                       SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLITUNE_Msk                               /*!< PLL integral path tune */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLPTUNE_Pos                   (2U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLPTUNE_Msk                   (0xFUL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLPTUNE_Pos)                     /*!< 0x0000003C */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLPTUNE                       SYSCFG_USB2PHY1TRIM1CR_USB2PHY1PLLPTUNE_Msk                               /*!< PLL proportional path tune */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1COMPDISTUNE_Pos                (6U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1COMPDISTUNE_Msk                (0x7UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1COMPDISTUNE_Pos)                  /*!< 0x000001C0 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1COMPDISTUNE                    SYSCFG_USB2PHY1TRIM1CR_USB2PHY1COMPDISTUNE_Msk                            /*!< Disconnect threshold adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1SQRXTUNE_Pos                   (9U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1SQRXTUNE_Msk                   (0x7UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1SQRXTUNE_Pos)                     /*!< 0x00000E00 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1SQRXTUNE                       SYSCFG_USB2PHY1TRIM1CR_USB2PHY1SQRXTUNE_Msk                               /*!< Squelch threshold adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1VDATREFTUNE_Pos                (12U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1VDATREFTUNE_Msk                (0x3UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1VDATREFTUNE_Pos)                  /*!< 0x00003000 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1VDATREFTUNE                    SYSCFG_USB2PHY1TRIM1CR_USB2PHY1VDATREFTUNE_Msk                            /*!< Data detect voltage adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1OTGTUNE_Pos                    (14U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1OTGTUNE_Msk                    (0x7UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1OTGTUNE_Pos)                      /*!< 0x0001C000 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1OTGTUNE                        SYSCFG_USB2PHY1TRIM1CR_USB2PHY1OTGTUNE_Msk                                /*!< VBUS valid threshold adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXHSXVTUNE_Pos                 (17U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXHSXVTUNE_Msk                 (0x3UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXHSXVTUNE_Pos)                   /*!< 0x00060000 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXHSXVTUNE                     SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXHSXVTUNE_Msk                             /*!< Transmitter high-speed crossover adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXFSLSTUNE_Pos                 (19U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXFSLSTUNE_Msk                 (0xFUL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXFSLSTUNE_Pos)                   /*!< 0x00780000 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXFSLSTUNE                     SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXFSLSTUNE_Msk                             /*!< Full-speed (FS)/low-speed (LS) source impedance adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXVREFTUNE_Pos                 (23U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXVREFTUNE_Msk                 (0xFUL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXVREFTUNE_Pos)                   /*!< 0x07800000 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXVREFTUNE                     SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXVREFTUNE_Msk                             /*!< HS DC voltage level adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRISETUNE_Pos                 (27U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRISETUNE_Msk                 (0x3UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRISETUNE_Pos)                   /*!< 0x18000000 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRISETUNE                     SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRISETUNE_Msk                             /*!< High-speed transmitter rise/fall time adjustment */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRESTUNE_Pos                  (29U)
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRESTUNE_Msk                  (0x3UL << SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRESTUNE_Pos)                    /*!< 0x60000000 */
#define SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRESTUNE                      SYSCFG_USB2PHY1TRIM1CR_USB2PHY1TXRESTUNE_Msk                              /*!< USB source impedance adjustment */

/************  Bit definition for SYSCFG_USB2PHY1TRIM2CR register  ************/
#define SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPAMPTUNE_Pos            (0U)
#define SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPAMPTUNE_Msk            (0x3UL << SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPAMPTUNE_Pos)              /*!< 0x00000003 */
#define SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPAMPTUNE                SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPAMPTUNE_Msk                        /*!< HS transmitter preemphasis current control */
#define SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPPULSETUNE_Pos          (2U)
#define SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPPULSETUNE_Msk          (0x1UL << SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPPULSETUNE_Pos)            /*!< 0x00000004 */
#define SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPPULSETUNE              SYSCFG_USB2PHY1TRIM2CR_USB2PHY1TXPREEMPPULSETUNE_Msk                      /*!< HS transmitter preemphasis duration control */

/****************  Bit definition for SYSCFG_USBHCR register  *****************/
#define SYSCFG_USBHCR_USBH_OVRCUR_POLARITY_Pos                        (0U)
#define SYSCFG_USBHCR_USBH_OVRCUR_POLARITY_Msk                        (0x1UL << SYSCFG_USBHCR_USBH_OVRCUR_POLARITY_Pos)                          /*!< 0x00000001 */
#define SYSCFG_USBHCR_USBH_OVRCUR_POLARITY                            SYSCFG_USBHCR_USBH_OVRCUR_POLARITY_Msk                                    /*!< Polarity of USBH_OVRCUR alternate function */
#define SYSCFG_USBHCR_USBH_VBUSEN_POLARITY_Pos                        (1U)
#define SYSCFG_USBHCR_USBH_VBUSEN_POLARITY_Msk                        (0x1UL << SYSCFG_USBHCR_USBH_VBUSEN_POLARITY_Pos)                          /*!< 0x00000002 */
#define SYSCFG_USBHCR_USBH_VBUSEN_POLARITY                            SYSCFG_USBHCR_USBH_VBUSEN_POLARITY_Msk                                    /*!< Polarity of USBH_VBUSEN alternate function */

/***************  Bit definition for SYSCFG_USBHARCR register  ****************/
#define SYSCFG_USBHARCR_AREN_Pos                                      (0U)
#define SYSCFG_USBHARCR_AREN_Msk                                      (0x1UL << SYSCFG_USBHARCR_AREN_Pos)                                        /*!< 0x00000001 */
#define SYSCFG_USBHARCR_AREN                                          SYSCFG_USBHARCR_AREN_Msk                                                  /*!< Address remapping enable */

/**************  Bit definition for SYSCFG_USB2PHY2CR register  ***************/
#define SYSCFG_USB2PHY2CR_RETENABLEN2_Pos                             (0U)
#define SYSCFG_USB2PHY2CR_RETENABLEN2_Msk                             (0x1UL << SYSCFG_USB2PHY2CR_RETENABLEN2_Pos)                               /*!< 0x00000001 */
#define SYSCFG_USB2PHY2CR_RETENABLEN2                                 SYSCFG_USB2PHY2CR_RETENABLEN2_Msk                                         /*!< Retention mode enable (active low) */
#define SYSCFG_USB2PHY2CR_AUTORSMENB2_Pos                             (1U)
#define SYSCFG_USB2PHY2CR_AUTORSMENB2_Msk                             (0x1UL << SYSCFG_USB2PHY2CR_AUTORSMENB2_Pos)                               /*!< 0x00000002 */
#define SYSCFG_USB2PHY2CR_AUTORSMENB2                                 SYSCFG_USB2PHY2CR_AUTORSMENB2_Msk                                         /*!< Auto-resume mode enable */
#define SYSCFG_USB2PHY2CR_USB2PHY2CMN_Pos                             (2U)
#define SYSCFG_USB2PHY2CR_USB2PHY2CMN_Msk                             (0x1UL << SYSCFG_USB2PHY2CR_USB2PHY2CMN_Pos)                               /*!< 0x00000004 */
#define SYSCFG_USB2PHY2CR_USB2PHY2CMN                                 SYSCFG_USB2PHY2CR_USB2PHY2CMN_Msk                                         /*!< Control of power down of analog blocks during Suspend and Sleep */
#define SYSCFG_USB2PHY2CR_USB2PHY2SEL_Pos                             (4U)
#define SYSCFG_USB2PHY2CR_USB2PHY2SEL_Msk                             (0x7UL << SYSCFG_USB2PHY2CR_USB2PHY2SEL_Pos)                               /*!< 0x00000070 */
#define SYSCFG_USB2PHY2CR_USB2PHY2SEL                                 SYSCFG_USB2PHY2CR_USB2PHY2SEL_Msk                                         /*!< PHY reference clock speed setting */

